[
  {
    "id": "47826",
    "title": "Skibidi Toilet Geometry Rash",
    "description": "The objective of Skibidi Toilet Geometry Rash is to guide your chosen character through a series of geometry-based obstacles, cunningly designed to test players reflexes and problem-solving skills. Jump, slide, and dash your way through an array of creatively designed levels. Jump in and start playing now!",
    "instructions": "Mouse Up arrow letter W or space ",
    "url": "https:\/\/html5.gamemonetize.com\/eckse54kyphdhxlj2tnd7yq3xtp4pbo4\/",
    "category": "Arcade",
    "tags": "Arcade, Avoid, Boy, HTML5, Hypercasual, jump, Skill",
    "thumb": "https:\/\/img.gamemonetize.com\/eckse54kyphdhxlj2tnd7yq3xtp4pbo4\/512x384.jpg",
    "width": "854",
    "height": "480"
  },
  {
    "id": "47106",
    "title": "Crossword Kingdom",
    "description": "Crossword Kingdom is a challenging vocabulary game where you fill in words in the given crossword puzzle. You can form any meaningful word by connecting letters. Extra meaningful words will give you an extra score. Check your spelling and vocabulary skills and learn new words while playing with the alphabet letters.",
    "instructions": "Use a mouse or touchpad to connect the letters and form the meaningful words for filling crossword puzzle ",
    "url": "https:\/\/html5.gamemonetize.com\/phfi8n3p1nz1zehem6dmzqieuklzyjls\/",
    "category": "Puzzle",
    "tags": "Kids, Mobile, Puzzle, Skill, Word",
    "thumb": "https:\/\/img.gamemonetize.com\/phfi8n3p1nz1zehem6dmzqieuklzyjls\/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "46122",
    "title": "Maze Love Balls",
    "description": "Are you seeking a stimulating puzzle game to challenge your cognitive prowess and unleash your imagination? Look no further than Love Balls Maze! This extraordinary game is designed to put your skills to the test. Your objective is simple yet deceivingly difficult: help two balls reunite. However, be prepared to encounter a myriad of obstacles at each level that impede the balls progress. Successfully guiding them toward each other calls for resourcefulness and ingenious problem-solving. Its time to showcase your aptitude for puzzle-solving to the world. Get ready to embark on this exciting journey with Maze Love Balls!",
    "instructions": "Slide and hold to move two balls and make them meet each other",
    "url": "https:\/\/html5.gamemonetize.com\/quy3uokbhnnrxpqu5iczp6xqkun5tytl\/",
    "category": "Hypercasual",
    "tags": "3D, Android, Arcade, Ball, Boy, Casual, Girl, iPad, iPhone, Kids, Maze, Mobile, Mouse, Online",
    "thumb": "https:\/\/img.gamemonetize.com\/quy3uokbhnnrxpqu5iczp6xqkun5tytl\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "46390",
    "title": "BMX Boy Online",
    "description": "Accelerate, soar through the air, and execute a variety of impressive maneuvers while ensuring a safe landing. BMX Boy Online offers a remarkable blend of simplicity and captivating gameplay. The mechanics are straightforward - simply amplify your speed and leap over hurdles on the track to accumulate as many points as possible. Utilize the two on-screen buttons (the right button for acceleration and the other for jumping) to navigate through the course. Unleash your flair by performing dazzling stunts mid-air for additional points. The primary objective remains consistent: masterfully maneuver your way through obstacles, enjoy!",
    "instructions": "PC WASD to operate Mobile Tp those buttons on the screen to operate",
    "url": "https:\/\/html5.gamemonetize.com\/lzhya6ep5ilwwkj5ho7mokm43ftzdbxv\/",
    "category": "Racing",
    "tags": "Balance, Bike, BMX, BMX Games, Boy, Driving, Highscore, jump, Kids, Mobile, Obstacle, Online, Skill, Stunts",
    "thumb": "https:\/\/img.gamemonetize.com\/lzhya6ep5ilwwkj5ho7mokm43ftzdbxv\/512x384.jpg",
    "width": "1334",
    "height": "750"
  },
  {
    "id": "46982",
    "title": "Save My Skibidi",
    "description": "Pets Sever is game which you will like for sure its a game of puzzles kind. The game goal is to drew a box that had your pet from getting attacked by bees each level is harder than the one before of it.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/h3578tixzxp7c7k6lgezgh3wcl5s4nt3\/",
    "category": "Puzzle",
    "tags": "Android, Brain, Educational, HTML5, iPhone, Mobile, Skibidi, Skibidi Toilet",
    "thumb": "https:\/\/img.gamemonetize.com\/h3578tixzxp7c7k6lgezgh3wcl5s4nt3\/512x384.jpg",
    "width": "300",
    "height": "600"
  },
  {
    "id": "47790",
    "title": "Archery World Tour Game",
    "description": "Use your mouse to aim and fire your bow. Hold your left mouse button to draw, and release to fire. The crosshairs will slowly follow your cursor as you move your mouse. In most levels, youll need to pay attention to the wind speed and direction if you want to hit the bullseye.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/qzlrdm6ysgu6q79fl2z3g572839q9fmt\/",
    "category": "",
    "tags": "Boy, Highscore, Kid, Shooting, Skill",
    "thumb": "https:\/\/img.gamemonetize.com\/qzlrdm6ysgu6q79fl2z3g572839q9fmt\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47792",
    "title": "Plane Shooter",
    "description": "Prepare for thrilling aerial combat in our action-packed Plane Shooter game! Take control of a powerful fighter plane as you navigate through intense enemy territory, engaging in epic dogfights and dodging enemy fire. Test your skills and reflexes as you shoot down waves of enemies and boss planes in a visually stunning, fast-paced experience.",
    "instructions": "Use Left Right Up and Down Arrow keys to move Left Right Up and Down Respectively You can also drag the plane using mouse in any direction For mobile devices use your finger to drag the plane ",
    "url": "https:\/\/html5.gamemonetize.com\/9au6hds7l82msv86cxnmhn57heuc3udd\/",
    "category": "Shooting",
    "tags": "1 Player, 2D, Action, Plane, Shooter, Shooting",
    "thumb": "https:\/\/img.gamemonetize.com\/9au6hds7l82msv86cxnmhn57heuc3udd\/512x384.jpg",
    "width": "450",
    "height": "1000"
  },
  {
    "id": "39107",
    "title": "Gun Run!   Gun Sprint",
    "description": "Flip the gun and move forward to reach the goal! When you tap the screen, the gun will shoot and flip forward or backward! Focus on the tap timing, shoot the enemies, and get high score! If the gun fly high, it will be hard to control.",
    "instructions": "Touch or Click",
    "url": "https:\/\/html5.gamemonetize.com\/67h1zmfqpw4my22n7s5kz0j6c4087uh0\/",
    "category": "Shooting",
    "tags": "3D, Action, Battle, Gun, HTML5, Hypercasual, weapons",
    "thumb": "https:\/\/img.gamemonetize.com\/67h1zmfqpw4my22n7s5kz0j6c4087uh0\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47771",
    "title": "Cats Picnic",
    "description": "Cats Picnic Link is a Match 3 Puzzle Game. it is an exciting challenging game for gamers of all age. It is cheerful fun game. very easy to learn. By connecting three or more similar Fish items, you can assist the cats in enjoying a picnic. You can quickly empty the board by matching various Fish. Your score increases if you match more items.",
    "instructions": "Desktop Use the right button of the mouse to match the fishes Mobile Drag and match the fishes to win ",
    "url": "https:\/\/html5.gamemonetize.com\/tdcti1b06p3yxdefy7fnp3ldx02z7f14\/",
    "category": "Puzzle",
    "tags": "Animal, Cat, HTML, HTML5, Match-3, Match3, Matching, Online, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/tdcti1b06p3yxdefy7fnp3ldx02z7f14\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47074",
    "title": "Skibidi Jumping",
    "description": "Cube Jumping is a 3D Game that you absolutely like. the game aimes to test your reaction speed by making mutliple platforms moving to left and right and you job is to click each time that there is a platform infront of your cub.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/33ek6qw5gbnqpi7mtkcgykgjcklbi4r7\/",
    "category": "Clicker",
    "tags": "Adventure, Android, Click, Fun, HTML5, iPhone, Kids, Mobile, Skibidi, Skibidi Toilet",
    "thumb": "https:\/\/img.gamemonetize.com\/33ek6qw5gbnqpi7mtkcgykgjcklbi4r7\/512x384.jpg",
    "width": "300",
    "height": "600"
  },
  {
    "id": "47636",
    "title": "Train subway surfers",
    "description": "Introducing Train Surfers - The Ultimate Subway Running Game! Embark on an adrenaline-fueled adventure with Train Surfers, a heart-pounding runner game that will immerse you in the fast-paced world of subway surfing. Jump into a thrilling experience that blends the excitement of subway escapades with the captivating allure of endless running. Get ready to dash, dodge, and surf your way through the bustling cityscape as you aim to set new records and become the ultimate subway surfer!",
    "instructions": "Move the Player With Mouse and Touch The Screen ",
    "url": "https:\/\/html5.gamemonetize.com\/nnaxxq7w2nt83q6k2qjd60ae1tavjtw3\/",
    "category": "Racing",
    "tags": "Hypercasual, run, running, subway, Subway Surfers",
    "thumb": "https:\/\/img.gamemonetize.com\/nnaxxq7w2nt83q6k2qjd60ae1tavjtw3\/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "47769",
    "title": "Skibidi Toilet Video Call",
    "description": "Skibidi Toilet video call is a simple app for you to make a fake call video with the infamous Skibidi Toilet and chat live with him. Skibidi Toilet will accompany your days in your free time when you feel lonely and bored then entertain yourself with video calls from your idol Skibidi. Enjoy calling your favorite Skibidi Toilet and talking with him in all fun ways. Skibidi Toilet video call is always a prank app for everyone! Skibidi Toilet has something to tell you, will you pick up the phone?",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/1nxuc5rt3wo9nzkvquvu618dbamlnzk9\/",
    "category": "Puzzle",
    "tags": "Android, Arcade, Casual, Mario, Online, Simulation, Simulator, Skibidi Toilet, WebGL, World",
    "thumb": "https:\/\/img.gamemonetize.com\/1nxuc5rt3wo9nzkvquvu618dbamlnzk9\/512x384.jpg",
    "width": "504",
    "height": "800"
  },
  {
    "id": "47635",
    "title": "Messi New Challenge",
    "description": "Messi makes the move to a new Continent and new challenges await. Participate in the excitement and go through numerous goal scoring and skill testing levels and earn trophies too.",
    "instructions": "Mouse or finger to move player during juggling levels swipe to shoot at targets or goal",
    "url": "https:\/\/html5.gamemonetize.com\/8m3ox950lsb3vxarbxdfuwlnftq41i3p\/",
    "category": "Sports",
    "tags": "Football, Soccer, Sport",
    "thumb": "https:\/\/img.gamemonetize.com\/8m3ox950lsb3vxarbxdfuwlnftq41i3p\/512x384.jpg",
    "width": "500",
    "height": "800"
  },
  {
    "id": "47740",
    "title": "Popcorn Time Game",
    "description": "Popcorn Time is an interesting puzzle game. Whether you are watching any kind of movie, you could not miss popcorn. How lucky, you have got a popcorn-making machine. It will make popcorn constantly when you press the mouse. You need to complete all levels to get them. Pop the popcorn to the target line. Dont let the popcorn fall to the ground. There are so many challenges waiting for you.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/u14lq7dtklk7qdvtaj93tvt5jticsko1\/",
    "category": "",
    "tags": "Avoid, Brain, Food, Kid, Puzzle, Skill, Strategy",
    "thumb": "https:\/\/img.gamemonetize.com\/u14lq7dtklk7qdvtaj93tvt5jticsko1\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47654",
    "title": "Draw Pen Rush",
    "description": "Draw Pen Rush is a fun and exciting parkour game. Players control a robot to compete in parkour races, avoiding obstacles and collecting various parts to enhance their abilities and turn into big robots. The game is played in portrait mode, allowing players to see further down the track and prepare to avoid traps. Help the robot defeat the ultimate brain.",
    "instructions": "Slide left and right to avoid the obstacles and pick the part up to transform into bit robots ",
    "url": "https:\/\/html5.gamemonetize.com\/qbrhatbgvznrc319t64rwb90deypp9n4\/",
    "category": "Arcade",
    "tags": "Boat, Draw, Drawing, HTML5, Hypercasual, Obstacle, Platform, running, Skills, Sword, weapons",
    "thumb": "https:\/\/img.gamemonetize.com\/qbrhatbgvznrc319t64rwb90deypp9n4\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "47706",
    "title": "AQUA PANG",
    "description": "Fun in your hand ~ Aqua Pang! In a beautiful and peaceful Aqualand, One day land animals started taking our friends! Lets go to the Aqualand with your friends to protect it~ [Game Features] - You can easily enjoy the game with one hand. - You can play strategically, using the skills suitable for you. - Various 200 stages!",
    "instructions": "- Mouse click or tap to play - Drag to make 3 or more of the same fish close together ",
    "url": "https:\/\/html5.gamemonetize.com\/42h0h58sbqn83om03ytcapkt70umpy23\/",
    "category": "Puzzle",
    "tags": "Cute, Fish, Hypercasual, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/42h0h58sbqn83om03ytcapkt70umpy23\/512x384.jpg",
    "width": "340",
    "height": "600"
  },
  {
    "id": "47757",
    "title": "Cut The Buttons",
    "description": "Cut The Buttons is a creative puzzle game that challenges logic and trains the brain. With stunning graphics and simple controls, its a highly engaging puzzle game that appeals to players of all ages.",
    "instructions": "1 Use the mouse or finger to control 2 Select a button with the mouse as the starting point 3 Cut same-colored buttons on the same line 4 You cant cut the line with different-colored buttons 5 Dont leave any buttons at the end of the level ",
    "url": "https:\/\/html5.gamemonetize.com\/vw8bx99tx4dt410ss2f8hgn999uzsqzn\/",
    "category": "Puzzle",
    "tags": "Brain, Casual, cut, HTML5, Matching, Relaxation, Strategy",
    "thumb": "https:\/\/img.gamemonetize.com\/vw8bx99tx4dt410ss2f8hgn999uzsqzn\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "46583",
    "title": "Mini Stilts",
    "description": "Mini Stills is a retro-style game where you guide a blob character to his goal: A delicious candy! Use the blob stilts to help him to surpass obstacles and evade enemies to advance between all levels.",
    "instructions": "Desktop -C Space or Left-Click to use your Stilts Mobile -Touch to use your Stilts ",
    "url": "https:\/\/html5.gamemonetize.com\/mpodl0nk01rk4k2tckka7nf2mgz3mj9x\/",
    "category": "Arcade",
    "tags": "Arcade, Pixel, Retro",
    "thumb": "https:\/\/img.gamemonetize.com\/mpodl0nk01rk4k2tckka7nf2mgz3mj9x\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47733",
    "title": "Surprise Doll Dress Up",
    "description": "Attention to all blind box enthusiasts! Have you ever considered indulging in a thrilling Doll Collecting Game? Immerse yourself in the excitement as you unveil surprise blind boxes, acquire your very own virtual dolls, and engage in delightful playtime with them! Get ready to immerse yourself in sheer amusement! lol",
    "instructions": "Use the mouse or finger to tap to open the blind box and dress up beautiful characters ",
    "url": "https:\/\/html5.gamemonetize.com\/knav2n3g7i6rz021fm343twzw7yd8n8m\/",
    "category": "Girls",
    "tags": "Cute, Dress Up, Fashion, Fun, Girls, Hair, HTML5, Jewel, Kids, Mobile",
    "thumb": "https:\/\/img.gamemonetize.com\/knav2n3g7i6rz021fm343twzw7yd8n8m\/512x384.jpg",
    "width": "504",
    "height": "800"
  },
  {
    "id": "47779",
    "title": "Jungle Adventures",
    "description": "Let the monkey jump! The more the monkey will jump, the more bananas he will collect. Jungle Adventure is a fun game to play with it &rsquo;s graphics and sounds. Play attention to the monkey while he jumps. Do not let him fall. Use your keyboard to play the game if you are playing with your computer.",
    "instructions": "Desktop Use the right and left arrow keys of the keyboard to move characters left and right Click the right buttons of the mouse to jump characters Mobile Click on the screen to jump characters And swipe the screen to move left right Controls and I",
    "url": "https:\/\/html5.gamemonetize.com\/8jimnb4cw0j2t3petlfv2dhb09j88tqy\/",
    "category": "Clicker",
    "tags": "2D, Adventure, HTML, HTML5, Hypercasual, Monkey, Online",
    "thumb": "https:\/\/img.gamemonetize.com\/8jimnb4cw0j2t3petlfv2dhb09j88tqy\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47259",
    "title": "MC Flappy Steve ",
    "description": "This game is a flappy game where you can live the most important and most beautiful memories of your life, you will never be bored and you will really have fun, I wish you a good game",
    "instructions": "Just press anywhere on the screen If you are on a PC with the mouse ",
    "url": "https:\/\/html5.gamemonetize.com\/qja29juhi44vzafimglrq8z9c3wy2j6h\/",
    "category": "Hypercasual",
    "tags": ".io, 1 Player, 2D, Adult, Adventure, Arcade, Bird, Funny, Game, Minecraft, run",
    "thumb": "https:\/\/img.gamemonetize.com\/qja29juhi44vzafimglrq8z9c3wy2j6h\/512x384.jpg",
    "width": "135",
    "height": "240"
  },
  {
    "id": "47760",
    "title": "Animals Clicker",
    "description": "Animals Clicker is a clicker with lots of cards with cute animals and pets. Click on the cards to unlock new animals and unlock new levels. Get more coins and upgrade clicks, cashback timer and cashback limit and get bonus rewards. There are 30 different animals waiting for you in the game. The game has nice music with amazing graphics will not let you get bored.",
    "instructions": "Use Mouse for desktop and Touch Controls for mobile device",
    "url": "https:\/\/html5.gamemonetize.com\/0pndbc5uyqpcwoqw8lg60voqylucd4bu\/",
    "category": "Girls",
    "tags": "Animal, Card, Cartoon Network, Casual, Clicker, Cute, Game, HTML5, Kids",
    "thumb": "https:\/\/img.gamemonetize.com\/0pndbc5uyqpcwoqw8lg60voqylucd4bu\/512x384.jpg",
    "width": "1200",
    "height": "1600"
  },
  {
    "id": "47783",
    "title": "Fall Race 3D Game",
    "description": "Fall-Race-3D is an exciting arcade running game. You will race with other stickmen. Dont fall off the platforms. You must win the first title. For arriving at the other platforms, you must speed up or use Paraglider. Keep running until the end.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/109l1miiywe4g2iktt5k4saofb5gdczn\/",
    "category": "",
    "tags": "3D, Arcade, Avoid, Hypercasual, Kid, Obstacle, Skill",
    "thumb": "https:\/\/img.gamemonetize.com\/109l1miiywe4g2iktt5k4saofb5gdczn\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "47670",
    "title": "Maze Mania",
    "description": "Maze Mania is a thrilling puzzle game with twists and turns. Race against the clock to find a path from the entrance to the exit before time runs out. Can you solve 8 puzzles and emerge victorious? Give it your best shot!",
    "instructions": "You can play this game with keyboard arrow keys or mouse You can select controls from option dialog ",
    "url": "https:\/\/html5.gamemonetize.com\/gwwndd9goj7waf9vyqjgpwmx6rjj1kc4\/",
    "category": "Puzzle",
    "tags": "Arcade, HTML5, Kids, Maze, Mobile, Puzzle, Skill",
    "thumb": "https:\/\/img.gamemonetize.com\/gwwndd9goj7waf9vyqjgpwmx6rjj1kc4\/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "47522",
    "title": "draw lines.io",
    "description": "draw lines.io is a classic and challenging puzzle game. Your goal is to connect all the dots using horizontal and vertical connections close together and without overlapping. It is not necessary to follow a specific order or correct path to solve the puzzle, just that all the points are connected. The difficulty increases with each level.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/c9mw59zzrbnc1zdmcbcxypmfqlqxiueq\/",
    "category": "Puzzle",
    "tags": ".io Games, Android, Educational, HTML5, iPad, iPhone, Pipe",
    "thumb": "https:\/\/img.gamemonetize.com\/c9mw59zzrbnc1zdmcbcxypmfqlqxiueq\/512x384.jpg",
    "width": "300",
    "height": "600"
  },
  {
    "id": "45328",
    "title": "Lazy Jump Online",
    "description": "Slide, stumble, flip and flail your way through endless levels in this physics-based puzzle game. When your character has all the strength and coordination of a wet rag, you &rsquo;ll need really quick thinking and a firm grasp of the laws of physics to get them to complete even the simplest of tasks. Add to that a smattering of fiendish obstacles and unexpected mechanics, and it &rsquo;ll take all of your wits.",
    "instructions": "You go through endless levels of sliding stumbling flipping and flinging ",
    "url": "https:\/\/html5.gamemonetize.com\/npycpi1rn91379sihu4cbzsvvn5oosjy\/",
    "category": "Arcade",
    "tags": "Avoid, Boy, jump, Kids, Mobile, Online, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/npycpi1rn91379sihu4cbzsvvn5oosjy\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "47180",
    "title": "Merge Master: Skibidi Bop",
    "description": "Discover the fantasy world of skibidi monsters in the Merge Master: Skibidi Bop! Merge your terrible monsters, make them evolve and have the most powerful army. You need to use your tactics and your brain to combine monsters and fight the skibidi toilet! You need to evolve your monsters quickly and have a strong army! If you want to win this battle, you need to evolve your monster quickly to get a huge army! Come on!",
    "instructions": "Click monster buttons to buy monsters drag same monsters to merge them and get a higher-level monster",
    "url": "https:\/\/html5.gamemonetize.com\/7cno37tfianlivq29hanilqqtqak2ghv\/",
    "category": "Boys",
    "tags": "Alien, Android, Arena, Battle, Best, Boy, Boys, Fight, Kids, Kill, Monster, Skibidi Toilet, Strategy, War",
    "thumb": "https:\/\/img.gamemonetize.com\/7cno37tfianlivq29hanilqqtqak2ghv\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "47756",
    "title": "Basket Goal 1",
    "description": "Attention basketball and puzzle fans! Here is a game tailor-made for you - Basket Goal! In this game, you can unleash your basketball skills, shoot the ball into the basket, and feel the joy of victory.",
    "instructions": "1 Drag or use the keyboard to move the basketball 2 Move around the obstacles and make the ball enter the basket 3 Help you relax your mood and adjust your mindset ",
    "url": "https:\/\/html5.gamemonetize.com\/0eewki6edwqultsud1l2fagusqe0eq66\/",
    "category": "Puzzle",
    "tags": "Basketball, Brain, Casual, HTML5, Kids, Skill, Strategy",
    "thumb": "https:\/\/img.gamemonetize.com\/0eewki6edwqultsud1l2fagusqe0eq66\/512x384.jpg",
    "width": "1300",
    "height": "2000"
  },
  {
    "id": "46601",
    "title": "Bicycle Rush 3D",
    "description": "Here is a bicycle riding racing arcade game that is made from 3D cartoon game art animation. In normal racing mode, you can crash other AI riders and win first place. In Challenge mode, you need to avoid all obstacles and arrive at the finish line. Have a good time in the first-person view!",
    "instructions": "Drag to move left and right to dodge all kinds of obstacles",
    "url": "https:\/\/html5.gamemonetize.com\/wox48iadsukskgrs1fk9i5o2hxwm5azg\/",
    "category": "Action",
    "tags": "3D, Avoid, Bike, Mobile, Obstacle, Race, Simulation",
    "thumb": "https:\/\/img.gamemonetize.com\/wox48iadsukskgrs1fk9i5o2hxwm5azg\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "47750",
    "title": "Skibidi Toilet Memory Challenge",
    "description": "Introducing the Skibidi Toilet Memory Challenge &ndash;the ultimate and super fun memory game designed especially for kids! Get ready to embark on an exciting memory journey that will keep young minds engaged and entertained for hours on end. Best of all, its completely free to play! In this delightful game, children are invited to join the lovable character, Skibidi, on a thrilling memory adventure. Dive into the whimsical world of Skibidi and his toilet memories today!",
    "instructions": "Mouse to play ",
    "url": "https:\/\/html5.gamemonetize.com\/iqpt2ke67wlfzud2tok0otklryuqxk4r\/",
    "category": "Puzzle",
    "tags": "Collecting, Fun, HTML5, Kids, Memory, Skibidi Toilet, Skill",
    "thumb": "https:\/\/img.gamemonetize.com\/iqpt2ke67wlfzud2tok0otklryuqxk4r\/512x384.jpg",
    "width": "480",
    "height": "854"
  },
  {
    "id": "47553",
    "title": "My Best FF Outfits",
    "description": "Welcome to the My Best FF Outfits. Princesses Anna, Elsa, Snowwhite, and Ariel are more font FF game. They always love to wear the FF costumes and accessories. So they planned to try FF outfits. Join and help the girls to pick a suitable outfit for each one of them. Try to choose unique costumes and hairstyles. Play and have fun!",
    "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
    "url": "https:\/\/html5.gamemonetize.com\/1wentwjmbjdw7tou5ydsxvip1ug3avhw\/",
    "category": "Girls",
    "tags": "Dress Up, Fashion, Girls, Princess",
    "thumb": "https:\/\/img.gamemonetize.com\/1wentwjmbjdw7tou5ydsxvip1ug3avhw\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "1072",
    "title": "Ballz Hit",
    "description": "In the captivating Ball Hit game,players are immersed in an exciting world where skill and precision meet fun and challenge. The objective is simple yet addictive: control a ball that must hit various objects, each adorned with a specific number. The ultimate goal is to destroy these objects by accurately colliding the ball with the corresponding numbers. As players progress through different levels, the games complexity increases, demanding precise timing and strategic thinking. They must carefully aim the ball and calculate the trajectory to hit the target numbers and achieve the highest score possible. With each successful des",
    "instructions": "Use your Mouse to play For mobile you can use the touch",
    "url": "https:\/\/html5.gamemonetize.com\/d21puuhjmay6kcurt2niziu8i7j0nrr1\/",
    "category": "Arcade",
    "tags": "Android, Ball, HTML5, Mobile, Skill, Unity3D, WebGL",
    "thumb": "https:\/\/img.gamemonetize.com\/d21puuhjmay6kcurt2niziu8i7j0nrr1\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47710",
    "title": "Secret Agent 1",
    "description": "Secret Agent is a shooting puzzle game full of excitement and fun. You will play a secret agent and face various challenging tasks. There are various levels and difficulties in the game to ensure your gaming experience is long-lasting and fun. Come and challenge your skills and strategies and become the strongest agent!",
    "instructions": "1 Use the mouse or finger to drag on the screen to confirm the angle and shoot 2 Diversified task content allows you to experience different challenges 3 Each mission requires thinking and strategy bringing fun and challenges to players 4 The game",
    "url": "https:\/\/html5.gamemonetize.com\/4p88k82f2ebc76ej1ghnc6dh541qy61w\/",
    "category": "Puzzle",
    "tags": "Arcade, Brain, Casual, Gun, HTML5, Kids, Online, Physics, Platform, Shooting, Skill, Strategy",
    "thumb": "https:\/\/img.gamemonetize.com\/4p88k82f2ebc76ej1ghnc6dh541qy61w\/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "47330",
    "title": "Ship Up",
    "description": "Ship Up is a minimalist spaceship game that will test your skills and reflexes. In this exciting game, you take control of a spacecraft that moves vertically through a challenging obstacle-filled environment.",
    "instructions": "Click or use the mouse to move the player left or right",
    "url": "https:\/\/html5.gamemonetize.com\/m9m7mvbnht6e1hr2asjix6y9g5blml6a\/",
    "category": "Hypercasual",
    "tags": "Arcade, Mobile, Space",
    "thumb": "https:\/\/img.gamemonetize.com\/m9m7mvbnht6e1hr2asjix6y9g5blml6a\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "46584",
    "title": "Time Witch",
    "description": "Time Witch is a puzzle platformer where you control a witch with the power to distort time to make elements in the level faster or slower. Use wisely that power to help the witch to evade enemies and surpass obstacles.",
    "instructions": "Desktop -A D or arrow keys to move -W H Up Arrow key or space bar to jump -V Y I or Space to Distort the Time Mobile -Touch controls ",
    "url": "https:\/\/html5.gamemonetize.com\/ed2ywgpmol7o3lbo7lgzi6d8j28vro2j\/",
    "category": "Puzzle",
    "tags": "Arcade, Magic, Pixel, Platform, Puzzle, Retro",
    "thumb": "https:\/\/img.gamemonetize.com\/ed2ywgpmol7o3lbo7lgzi6d8j28vro2j\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47380",
    "title": "Tank Napoleon",
    "description": "You are the commander of a tank brigade - collect unique tanks to your taste and go into battle! Liberate the lands of the Supreme Council from the rebellious forces. Battles of 12 by 12 tanks are waiting for you. Develop your battle strategy and get into the top of the best tankers.",
    "instructions": "Mouse click or tap to play At the beginning of the game you can immediately go into battle to earn your first money to buy a new tank There will be hints in the battle Collect your tank configurations and enter a new battle ",
    "url": "https:\/\/html5.gamemonetize.com\/yt71j3xn3opwb6ablihy1nndq9rg3nsq\/",
    "category": "Shooting",
    "tags": "Battle, Strategy, Tank, Tanks, War",
    "thumb": "https:\/\/img.gamemonetize.com\/yt71j3xn3opwb6ablihy1nndq9rg3nsq\/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "47631",
    "title": "Sakura School Girl Yandere Simulator",
    "description": "Sakura School Girl Yandere Simulator is a fight simulator, where you have to fight all school girl in your school. Most fun to fight with your enemies. You finally find out who is steeper in all the school fights without rules. Please enjoy high school life in Japan. Addicting and interactive battle game Apply your strategy to win the great high school battle Be ready to meet furious girl in Yandere FEATURED: -20 exciting levels -hundred of character shown in game -Cool fighting mission each level",
    "instructions": "WASD move mouse cursor aim Left mouse button shoot",
    "url": "https:\/\/html5.gamemonetize.com\/e9t2cmcjznwp5rngpscfb70c5uo9dpli\/",
    "category": "Adventure",
    "tags": "Brawl, Fighting, Girl, School, Simulation",
    "thumb": "https:\/\/img.gamemonetize.com\/e9t2cmcjznwp5rngpscfb70c5uo9dpli\/512x384.jpg",
    "width": "960",
    "height": "600"
  },
  {
    "id": "47739",
    "title": "Car Racing: 3D Drive Mad",
    "description": "Here is a car racing arcade game. You have a chance to control a car equiped with nitro system. You can collect the fuel to charge it. Try to defeat other AI players by avoiding obstacles and using nitro items. Have a good time!",
    "instructions": "PC AD move The other functions tap the buttons Mobile Tap the buttons",
    "url": "https:\/\/html5.gamemonetize.com\/u92w5m8oarc9vrcbaya824qonh7lgij3\/",
    "category": "Action",
    "tags": "3D, Avoid, Car, Collecting, Driving, Mobile, Racing, Simulation, Stunts",
    "thumb": "https:\/\/img.gamemonetize.com\/u92w5m8oarc9vrcbaya824qonh7lgij3\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "47729",
    "title": "Skibidi Toilet Friends",
    "description": "Are you ready for the adventure of two friends? Achieve victory with teamwork. You should move with your friend. You should support your friend. two toilet men need to reach the door. proceed in order. Reach the door in this fun for two. Watch out for moving obstacles. You must reach the door before you die. neither of you should die.",
    "instructions": " Blue player use Arrow keys to move Red player use WASD to move Mobile Touch Control",
    "url": "https:\/\/html5.gamemonetize.com\/jvgcmyn4aqpf23w7gmww6x8cdo9nzefi\/",
    "category": "Action",
    "tags": "2 Player, 2 Player Games, 2D, Adventure, Android, Arcade, Mobile, Skibidi Toilet",
    "thumb": "https:\/\/img.gamemonetize.com\/jvgcmyn4aqpf23w7gmww6x8cdo9nzefi\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47628",
    "title": "Skibidi vs Noob &amp;Cameraman",
    "description": "Two friends are running away from the monster. The toilet monster is chasing. Escape the toilet monster. toilet monster can kill you. collect all the gold. Collect the gold to open the portal. Jump over obstacles, go faster than some. run with your friend, dont stop. reach the portal. boiler.",
    "instructions": " Noob player use Arrow keys to move Cameraman player use WASD to move Noob player only collects gold Cameraman player activate the wall by pressing the E key Mobile Touch Control",
    "url": "https:\/\/html5.gamemonetize.com\/u1iivhtg4pg3nalkpqwo5jray0ku3g7r\/",
    "category": "Arcade",
    "tags": "1 Player, 2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Minecraft, Pixel, Skibidi Toilet",
    "thumb": "https:\/\/img.gamemonetize.com\/u1iivhtg4pg3nalkpqwo5jray0ku3g7r\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47620",
    "title": "Farm 2048",
    "description": "Merge the dropped cards to end up with the number 2048 and free up space for the next cards! Farm 2048 is a fun math puzzle game that will challenge your ability to use even numbers. Get more points to go to the next level and unlock the ability to cancel the wrong move.",
    "instructions": "Use Mouse for desktop and Touch Controls for mobile device",
    "url": "https:\/\/html5.gamemonetize.com\/z0kifnazesu2oe1jonuc6v5g13h0g4xv\/",
    "category": "Puzzle",
    "tags": "2D, Android, Animal, Bejeweled, Board, Brain, Card, Educational, Farm, Game, HTML5, iPad, iPhone, Logical",
    "thumb": "https:\/\/img.gamemonetize.com\/z0kifnazesu2oe1jonuc6v5g13h0g4xv\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47662",
    "title": "Barbiecore",
    "description": "How about a new fashion trend? Hot pink and bubblegum are on the rise, but in this cute doll dress-up game, its all about sweet girl Ellie! Pink is her favorite color and Barbiecore is her favorite aesthetics, you know what you have to do next. Create cute casual and sporty chic looks while playing this free-to-play dress-up game for girls called Barbiecore!",
    "instructions": "Use your mouse to click the category tabs and select the clothing pieces and accessories you fancy the most ",
    "url": "https:\/\/html5.gamemonetize.com\/2gx8iupbt9ed1lnf3bhziy957j6jqi63\/",
    "category": "Girls",
    "tags": "1 Player, Barbie, Dress Up, Fashion, Game, Games, Girls, Makeover, Summer",
    "thumb": "https:\/\/img.gamemonetize.com\/2gx8iupbt9ed1lnf3bhziy957j6jqi63\/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "47724",
    "title": "Skibidi And The Pumpkin",
    "description": "Hey Mr. Pumpkin you need to escape from the Skibidi Toilet! Try to resit the more you can and complete all 20 Levels! Enjoy this summer season with this great trend game!",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/fyu3dymni8ou08mmqqy9nn50etojouhi\/",
    "category": "Hypercasual",
    "tags": "Arcade, Boy, Halloween, HTML, jump, Jumping, Mobile, Skibidi Toilet",
    "thumb": "https:\/\/img.gamemonetize.com\/fyu3dymni8ou08mmqqy9nn50etojouhi\/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "47716",
    "title": "Cyborg Runner",
    "description": "Run as fast as you can! Avoid obstacles, monster and collect batteries of defense systems. You can find defense systems while running. The shield will protect you from some barriers and monsters. Good luck!",
    "instructions": "keyboard mouse or touch turn left arrow left A swipe left turn right arrow right D swipe right jump arrow up W swipe up roll arrow down S swipe down",
    "url": "https:\/\/html5.gamemonetize.com\/mh9m7p1cul2hvk3614saal7ll5kboc9y\/",
    "category": "Arcade",
    "tags": "1 Player, 3D, 3D Games, Action, Adventure, Android, Arcade, endless, Unity3D, WebGL",
    "thumb": "https:\/\/img.gamemonetize.com\/mh9m7p1cul2hvk3614saal7ll5kboc9y\/512x384.jpg",
    "width": "960",
    "height": "600"
  },
  {
    "id": "47632",
    "title": "Line 98 Classic",
    "description": "Line98 is a classic puzzle game that challenges your logic and strategy skills. The goal is to arrange balls of the same color in lines of five or more to clear the board and score points. You can move any ball to any empty cell, but you have to plan ahead and avoid filling up the board. Line98 is simple to play but hard to master. Can you beat your own high score? Every time you move a ball, three new balls will appear randomly on the board. The game ends when the board is full and there are no more moves possible!",
    "instructions": "Touch to select ball and move on empty cell You can move any ball to any empty cell on the board as long as there is a clear path between them ",
    "url": "https:\/\/html5.gamemonetize.com\/7tujnyv9n91pgrocaxdu0jsq17ctrij4\/",
    "category": "Puzzle",
    "tags": "1 Player, 2D, Ball, Classic, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/7tujnyv9n91pgrocaxdu0jsq17ctrij4\/512x384.jpg",
    "width": "480",
    "height": "800"
  },
  {
    "id": "47726",
    "title": "Snake Eats Apple",
    "description": "Snake Eats Apple is a fun online game where you control a snake and try to eat as many apples as possible. The objective of the game is to grow your snake by eating the apples, but be careful not to run into the walls or your own tail! The game gets more challenging as your snake grows longer, so make sure to plan your moves carefully. So, stay focused and try to beat your high score with each playthrough! Enjoy playing",
    "instructions": "Use the arrow keys on your keyboard to control the snakes movements The snake will move in the direction of the arrow key you press Also you can use the mouse or tap on the game screen if you play on a mobile device ",
    "url": "https:\/\/html5.gamemonetize.com\/znd57xkipqdx5tj7nh5lhwcxgcbhm1kj\/",
    "category": "Arcade",
    "tags": "Arcade, HTML5, Puzzle, Snake",
    "thumb": "https:\/\/img.gamemonetize.com\/znd57xkipqdx5tj7nh5lhwcxgcbhm1kj\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47644",
    "title": "Obstacle Racing",
    "description": "Obstacle Racing is an exciting game that will put your skills to the test! Your mission is to overcome obstacles and earn money as you race endlessly through different themes. With five awesome themes to choose from, each with its own unique look and feel, you will never get bored. Use the money you earn to unlock themes and expand your racing experience. Can you conquer all the obstacles and become the ultimate champion? Jump, dodge, and race your way to victory in Obstacle Racing",
    "instructions": "Use Right Arrow Key or D to move forwards Use Left Arrow key or A to move backwards You can also use the forward and backward button given in the game to control the vehicle",
    "url": "https:\/\/html5.gamemonetize.com\/7n2owcvovcooopthz1j60ujr6i6y98d2\/",
    "category": "Racing",
    "tags": "1 Player, 2D, Adventure, Car, endless, Obstacle, WebGL",
    "thumb": "https:\/\/img.gamemonetize.com\/7n2owcvovcooopthz1j60ujr6i6y98d2\/512x384.jpg",
    "width": "1000",
    "height": "450"
  },
  {
    "id": "47281",
    "title": "Scribble World Platform Puzzle Game",
    "description": "Scribble World Platform Puzzle is a free online platform jumping game. It provides players with a sense of satisfaction as they overcome each challenge. The games art style utilizes unique hand-drawn graphics. The game features many levels, each with unique obstacles and puzzles. It provides players with a sense of satisfaction as they overcome each challenge. Start the game now, and help the character get home!",
    "instructions": "1 Use WASD or arrow keys to move You can also tap the screen to control on mobile devices 2 Avoid the obstacles in the way to survive 3 Step on the trap brick with the key pattern to open the gate 4 Collect coins as more as you can ",
    "url": "https:\/\/html5.gamemonetize.com\/qxbeq7wqopxqweqr3v8pfmtejfw12egy\/",
    "category": "Puzzle",
    "tags": "Arcade, Avoid, Boy, Brain, Casual, Fun, HTML5, Jumping, Kids, Obstacle, Platform",
    "thumb": "https:\/\/img.gamemonetize.com\/qxbeq7wqopxqweqr3v8pfmtejfw12egy\/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "47448",
    "title": "Goal Quest",
    "description": "Experience the fusion of sports and puzzle-solving in this captivating 2D soccer ball game. Break through cube stone obstacles by simply touching them, clearing your path to the goal. But it &rsquo;s not just about scoring; you must also collect three stars scattered throughout each level to unlock new challenges. Navigate intricate mazes, utilize physics, and explore visually stunning environments as you strive to become the ultimate soccer ball champion. Are you ready for an adventure filled with excitement, discovery, and a touch of soccer magic?",
    "instructions": "Desktop Explode Cubes with leftmouse button Mobile Touch the screen and pop whatever you want",
    "url": "https:\/\/html5.gamemonetize.com\/4gfskfmycte9r79aaz1umeaj9lmyjkvh\/",
    "category": "Sports",
    "tags": "1 Player, Brain, Football, Fun, Funny, Puzzle, Soccer, Sport, Sports",
    "thumb": "https:\/\/img.gamemonetize.com\/4gfskfmycte9r79aaz1umeaj9lmyjkvh\/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "47609",
    "title": "Skibidi Toilet Rush",
    "description": "Skibidi Toilet Rush is a fun online game that you can play for free. No download needed to play it. The aim of the game is to go all the way to the finish line. Avoid obstacles on the way and kill the enemies before they kill you. Start playing and have fun.",
    "instructions": "Arrow keys to play Up arrow twice for dubble jump ",
    "url": "https:\/\/html5.gamemonetize.com\/c0juvuf7w31kjh9vkcj3muy9e3qdxby0\/",
    "category": "Arcade",
    "tags": "Arcade, Avoid, Boy, Hypercasual, Jumping, Kill, Platform, run, Skibidi Toilet, Skill",
    "thumb": "https:\/\/img.gamemonetize.com\/c0juvuf7w31kjh9vkcj3muy9e3qdxby0\/512x384.jpg",
    "width": "854",
    "height": "480"
  },
  {
    "id": "47243",
    "title": "Millionaire Kids Game",
    "description": "Millionaire Kids Game is an exciting question and answer game that brings all the excitement of the famous TV show right to your fingertips. Get ready to test your general knowledge in a thrilling competition against the clock. The game offers a challenging and fun experience where you can feel like a real participant of the show.",
    "instructions": "Tap the screen or use mouse to select the correct answer ",
    "url": "https:\/\/html5.gamemonetize.com\/oae403fgqt2efa5qq250wmwy6wxv5qid\/",
    "category": "Puzzle",
    "tags": "1 Player, 2D, Quiz",
    "thumb": "https:\/\/img.gamemonetize.com\/oae403fgqt2efa5qq250wmwy6wxv5qid\/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "47496",
    "title": "Skibidi Toilet Attack",
    "description": "Skibidi Toilet Attack is a thrilling and addictive casual online shooter game that promises hours of entertainment for players of all ages. With its simple yet engaging gameplay, the game allows players to immerse themselves in a fast-paced shooting experience while trying to survive against waves of enemies in various challenging levels. As an action-packed free online game, Skibidi Toilet Attack offers a unique and amusing concept that is perfect for those seeking fun games that can be played directly in their favorite web browser. Players can enjoy the game without the hassle of downloads or installations, simply by visiting kiz10.com",
    "instructions": "PC controls Use the mouse to shoot Touch controls touch the screen to shoot",
    "url": "https:\/\/html5.gamemonetize.com\/r4c7bg2psgoq3xj3vsed965dli6hm3ue\/",
    "category": "Clicker",
    "tags": "kiz10, Platform, Shooter, Skibidi Toilet, survival",
    "thumb": "https:\/\/img.gamemonetize.com\/r4c7bg2psgoq3xj3vsed965dli6hm3ue\/512x384.jpg",
    "width": "550",
    "height": "750"
  },
  {
    "id": "47697",
    "title": "Skibidi Flappy Poppy",
    "description": "Get ready for an exhilarating gaming experience with Skibidi Toilet game series! Step into the shoes of the beloved character Skibidi Toilet as you play through a high-stakes game inspired by the super series Flappy Bird in poppy style. Are you able to avoid all pipes and try to collect all medals? Enjoy this great game!",
    "instructions": "Use your Mouse to click or tap the screen to play ",
    "url": "https:\/\/html5.gamemonetize.com\/fqbwaar44gcqnk3u9d21kornuujbge4j\/",
    "category": "Shooting",
    "tags": "Action, Android, HTML5, Mobile, run, running, Shooting, Skibidi Toilet",
    "thumb": "https:\/\/img.gamemonetize.com\/fqbwaar44gcqnk3u9d21kornuujbge4j\/512x384.jpg",
    "width": "768",
    "height": "1024"
  },
  {
    "id": "47653",
    "title": "Robo Running 3D",
    "description": "Run with an ink man who does parkour. He holds a magical pen that can turn your drawings into real objects, such as boats, weapons, or even swim rings. But you must collect ink because without it, the pen will lose its magical power. Your ultimate goal is to overcome all obstacles and win the final Boss battle.",
    "instructions": "Swipe left and right to move left and right Run close to the parts to pick them up ",
    "url": "https:\/\/html5.gamemonetize.com\/k353r7i70su81n9px0spde5ayi6m6yjb\/",
    "category": "Arcade",
    "tags": "Avoid, Collecting, Collection, HTML5, Obstacle, Online, Platform, Robot, run, running, Skills",
    "thumb": "https:\/\/img.gamemonetize.com\/k353r7i70su81n9px0spde5ayi6m6yjb\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "47668",
    "title": "Mega Ramp Stunt Moto Game",
    "description": "Mega Ramp Stunt Moto is an interesting driving game. You will keep a tight rein on a motorcycle on an aerial platform and exhibit your mesmerizing driving stunts. In the process, you will encounter different obstacles. There are some acceleration items you can use in the game. You can make the best use of them to leave other players far behind.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/w5htph4ggrpc9i2to5s44akd4sb44ifb\/",
    "category": "",
    "tags": "3D, Bike, Boy, Kid, Platform, Race, Skills",
    "thumb": "https:\/\/img.gamemonetize.com\/w5htph4ggrpc9i2to5s44akd4sb44ifb\/512x384.jpg",
    "width": "1334",
    "height": "750"
  },
  {
    "id": "46911",
    "title": "Spaceship Destruction",
    "description": "Play the newest action shooter game Spaceship Destruction. The game has 7 different levels from easier to harder. The goal of the game is to destroy all the enemies who are attacking you, collecting energy items, bombs, shields, and more. Enjoy and have fun!",
    "instructions": "You can use the mouse or arrow keys to play this game ",
    "url": "https:\/\/html5.gamemonetize.com\/g2e77ahalq8bmd3ued7ryp6m78lhfwrp\/",
    "category": "Shooting",
    "tags": "Action, Flight, Shooting, Space, Spaceship",
    "thumb": "https:\/\/img.gamemonetize.com\/g2e77ahalq8bmd3ued7ryp6m78lhfwrp\/512x384.jpg",
    "width": "480",
    "height": "720"
  },
  {
    "id": "47563",
    "title": "Mini Coins",
    "description": "Mini Coins is an arcade game where you must collect all the coins in the level by jumping, wall jumping, avoiding obstacles and enemies controlling a small blob character. Get ready for over the speedrun mode!",
    "instructions": "Mobile -Touch to Jump Desktop -C Up Arrow or Left Click to Jump ",
    "url": "https:\/\/html5.gamemonetize.com\/iu5fpa6ap40naojpo1592oacpx80wriv\/",
    "category": "Arcade",
    "tags": "Arcade, Pixel, Platform, Retro",
    "thumb": "https:\/\/img.gamemonetize.com\/iu5fpa6ap40naojpo1592oacpx80wriv\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47113",
    "title": "Dungeon Chess",
    "description": "Dungeon Chess is a strategic puzzle game with roguelike elements, offering compact yet complex gameplay sessions. Manipulate cards to command your hero, resembling a chess piece on a miniature dungeon board. Outsmart adversaries utilizing their array of cunning abilities and ascend as the most formidable warrior of the Chess Lands! -Use a deck of chess pieces to battle hordes of monsters that have taken over the dungeons. -Even if youre unfamiliar with chess, you can quickly grasp the basics in just a few minutes. -Carefully plan your actions to navigate through challenging and unexpected tactical situations.",
    "instructions": "1 Start the game 2 Choose a card with a chess figure 3 Press where you want to move ",
    "url": "https:\/\/html5.gamemonetize.com\/a3guve8ts5eeq0xfn4jvhi6zru45btn7\/",
    "category": "Puzzle",
    "tags": "2D, Board, Brain, Card, Fantasy, Logic, Logical, Puzzle, RPG, Strategy",
    "thumb": "https:\/\/img.gamemonetize.com\/a3guve8ts5eeq0xfn4jvhi6zru45btn7\/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "47169",
    "title": "Steer Your Boat",
    "description": "You took your boat out on a beautiful summers day, but it seems a lot of other people had the same idea because the water is very crowded. Steer your boat so that you avoid colliding with the other boats and also be careful not to run over the swimmers out in the water.",
    "instructions": "Touch the game screen or use the mouse to move your boat left and right Avoid colliding with other boats and swimmers ",
    "url": "https:\/\/html5.gamemonetize.com\/d8msb5hjg5upe1dv1h7lc4wzo5cw7wku\/",
    "category": "Racing",
    "tags": "Boat, Driving",
    "thumb": "https:\/\/img.gamemonetize.com\/d8msb5hjg5upe1dv1h7lc4wzo5cw7wku\/512x384.jpg",
    "width": "480",
    "height": "864"
  },
  {
    "id": "46658",
    "title": "Switch! Out",
    "description": "Switch from wall to wall to avoid oncoming objects. Collect stars to increase your score. (Collect 5 in a row to increase your score by 5 and become invincible for a short time.) The longer you last, the better the score. - Features - - Fun, fast-paced action! - One-Touch gameplay - Tap screen to switch to opposite wall. - Gameplay changes as you progress - Game gets faster and harder! - Endless gameplay. - Appealing, simplistic graphics.",
    "instructions": "Click to switch walls ",
    "url": "https:\/\/html5.gamemonetize.com\/0f6jwzfuj7eszk74ow8lkutzu53zgnqs\/",
    "category": "Hypercasual",
    "tags": "2D, Android, Ball, Block, Casual, Click, endless, Game, Highscore, Hypercasual, iPhone, Mobile, Obstacle, unity",
    "thumb": "https:\/\/img.gamemonetize.com\/0f6jwzfuj7eszk74ow8lkutzu53zgnqs\/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "47350",
    "title": "Super Coin Pusher",
    "description": "try to get the coin droped in the hook, after you do it,you can get the coin droped in coin+5 or bonus+1, if the coin is droped in coin+5,5 coins will fall, if bonus reach 5,you can go to bonus scene and get more rewards.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/v7hm395kspiyn4upyt22uygvl2av5uff\/",
    "category": "Arcade",
    "tags": "1 Player, 3D Games, Arcade, Casual, Hot, HTML5, Physics, Skill, WebGL",
    "thumb": "https:\/\/img.gamemonetize.com\/v7hm395kspiyn4upyt22uygvl2av5uff\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47552",
    "title": "Rainbow Girls Space Core Aesthetic",
    "description": "Welcome to the Rainbow Girls Space Core Aesthetic. Who loves space adventure? Everyone right! Rainbow Girls Skyler, Sunny, Ruby, and Violet are adventurer high school girls planning to try space aesthetic outfits. Browse their wardrobe and pick a cute and suitable outfit for them. Join with the girls and have fun!",
    "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
    "url": "https:\/\/html5.gamemonetize.com\/bfcxvby3c19jj6lodk7m9vi2r2yaovcu\/",
    "category": "Girls",
    "tags": "Dress Up, Fashion, Girls",
    "thumb": "https:\/\/img.gamemonetize.com\/bfcxvby3c19jj6lodk7m9vi2r2yaovcu\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47587",
    "title": "Pregnant Mommy Caring",
    "description": "Pregnant Mommy Caring is a very fun and popular caring game. This time, we will face the challenge of taking care of Moms pregnancy days and her adorable newborn baby. We will be by this amazing moms side throughout the entire pregnancy. Experience basic check-ups, treat unexpected injuries, and witness the miracle of a babys birth. In this incredible motherhood simulator game, you will experience the greatness of motherhood and the true meaning of the continuation of life.",
    "instructions": "Follow the instructions and voice-over and use the mouse or finger to tap ",
    "url": "https:\/\/html5.gamemonetize.com\/c6w7h4odio0j0lv6r9rhwz7k2pokqfi2\/",
    "category": "Girls",
    "tags": "Baby, Doctor, Educational, Fun, Girl, HTML5, Kids, Mobile, Surgery",
    "thumb": "https:\/\/img.gamemonetize.com\/c6w7h4odio0j0lv6r9rhwz7k2pokqfi2\/512x384.jpg",
    "width": "504",
    "height": "800"
  },
  {
    "id": "47409",
    "title": "Hexa Merge 2048",
    "description": "- Game Hexa Merge 2048 is a fun and addictive puzzle game that combines elements of drop and merge games with the classic 2048 game. - The goal is to drop numbered tiles onto the board and merge them with adjacent tiles of the same value to create larger numbers. - The game ends when the board is full or when you reach the 2048 tile, whichever comes first. - You can choose from different modes, themes, and difficulties to customize your gaming experience. - Game Hexa Merge 2048 is a great way to train your brain, relax, and have fun at the same time.",
    "instructions": "Tap to drop numbers 2048 try to merge as much as possible ",
    "url": "https:\/\/html5.gamemonetize.com\/hpstq2pm2jq9jst29aynnpr2poomw59n\/",
    "category": "Puzzle",
    "tags": "1 Player, Arcade, Casual, Hypercasual, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/hpstq2pm2jq9jst29aynnpr2poomw59n\/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "47599",
    "title": "Pizza Cafe Tycoon",
    "description": "Are you ready to build a successful cafe empire with you? You currently own a pizza shop and customers love their delicious pizza. Your task is to deliver various pizza orders on time and quickly. Remember, speed and quality are everything in the cafe business. You have to work with dedication to ensure the satisfaction of your customers. Manage orders quickly and effectively without slowing down and offer your customers an unforgettable experience. Build your own strategies for success in your cafe empire and seize opportunities to grow your business.",
    "instructions": "How to play Desktop Mouse Mobile Touch control ",
    "url": "https:\/\/html5.gamemonetize.com\/ozrihsbvi9tirbdb9cnyu7rks1ydj8hc\/",
    "category": "Cooking",
    "tags": "Cook, Cooking, Game, Restaurant, Simulation, Street Fighting, Timing",
    "thumb": "https:\/\/img.gamemonetize.com\/ozrihsbvi9tirbdb9cnyu7rks1ydj8hc\/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "47652",
    "title": "Skibidi Jump",
    "description": "Do you love Skibidi Toilet? Well! you are in the right place to play a skibidi toilet game. Tap or click to jump colorful bathtubs to collect the little poops. Once you collect all poops, a toilet door will appear. Go to that door to unlock the next level and be careful with traps suction cups. Have fun and explore tons of amazing and challenging levels.",
    "instructions": "Tap or click to jump over obstacles and collect poops",
    "url": "https:\/\/html5.gamemonetize.com\/sy2m9vrlnwoa34qzsq95lkqh0nrg6o1z\/",
    "category": "Clicker",
    "tags": "Skibidi Toilet",
    "thumb": "https:\/\/img.gamemonetize.com\/sy2m9vrlnwoa34qzsq95lkqh0nrg6o1z\/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "47590",
    "title": "Super Mario &amp;Sonic FNF Dance",
    "description": "Super Mario &amp;Sonic FNF Dance is a rhythm action game. Featuring Super Mario and Sonic to perform great dance performance! Choose your music and defeat Sonic in this exciting battle dance music game. Upgrade your special performance to gain more score! Enjoy the cool song!",
    "instructions": "Use Arrow Keys Key 1 2 3 4 Special MOVES when available",
    "url": "https:\/\/html5.gamemonetize.com\/khgpgcan9lxdopmb1nu0p2hsuqpmglld\/",
    "category": "Hypercasual",
    "tags": "3D, 3D Games, Dancing, Fantasy, Mario, Music, Play, Rhythm, Simulation, unity, Unity3D, WebGL",
    "thumb": "https:\/\/img.gamemonetize.com\/khgpgcan9lxdopmb1nu0p2hsuqpmglld\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47624",
    "title": "Pop It Fidget : Anti Stress",
    "description": "What Is a Pop It Fidget Toy? Made of silicone, Pop It fidget toys feature bubbles that can be poked. These sensory toys are simple and fun to use. Research shows they may reduce stress and improve focus and fine motor control. Now you can play Pop It Fidget Toy in your virtual device, enjoy this entertainment to reduce stress Fidget toys give you a place to channel that energy. This serves as a distraction for the brain, potentially lowering anxiety and improving focus. Experts have mixed feelings about how effective they are",
    "instructions": "use mouse to play",
    "url": "https:\/\/html5.gamemonetize.com\/n1d5dgtiibgaa9o9ei2nj0ni233byd93\/",
    "category": "Puzzle",
    "tags": "Brain, Bubble, Casual, Click, Clicker, Crafting, Cute, Design, Educational, Fun, Girl, Kid, Sandbox, Simulator",
    "thumb": "https:\/\/img.gamemonetize.com\/n1d5dgtiibgaa9o9ei2nj0ni233byd93\/512x384.jpg",
    "width": "504",
    "height": "800"
  },
  {
    "id": "47154",
    "title": "Crazy BasketBall Machine",
    "description": "Experience the ultimate basketball shooting frenzy in Crazy Basketball Machine! Get ready to test your shooting skills and aim for glory on the court. This action-packed game combines the thrill of basketball with the excitement of precise shooting. Step up to the challenge, shoot hoops, and dominate the game like a true basketball superstar. With stunning visuals and addictive gameplay, Crazy Basketball Machine will keep you hooked as you shoot your way to victory. So grab your basketball and prepare for an adrenaline-fueled shooting extravaganza that will leave you craving for more!",
    "instructions": "Use mouse to play the game or tap the Screen to shoot the Ball ",
    "url": "https:\/\/html5.gamemonetize.com\/coedq4jfww6cxgkq0l39fchkl6uj3nbf\/",
    "category": "Sports",
    "tags": "Baseball, Basketball, Casual, Hypercasual, Shoot, Sport, Sports",
    "thumb": "https:\/\/img.gamemonetize.com\/coedq4jfww6cxgkq0l39fchkl6uj3nbf\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47306",
    "title": "Rope Experiment",
    "description": "Welcome to our Rope game! Tie the rope to dot-shaped needles, ensuring it touches them all. Challenge your skills in this puzzling adventure. Can you conquer every level? Get ready to knot, twist, and weave your way to victory!",
    "instructions": "How to Play Objective Connect all the dot-shaped needles by moving the rope with your mouse Mouse Controls Use your mouse to guide the rope Move the mouse to navigate the rope Click and hold to attach the rope to a needle Connect Needles Position ",
    "url": "https:\/\/html5.gamemonetize.com\/wj9xawzlvqj1iqt4lfzqs52fimq7sa6t\/",
    "category": "Puzzle",
    "tags": "1 Player, 2D, Adult, Adventure, Android, Arcade, iPhone, Physics, Platform, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/wj9xawzlvqj1iqt4lfzqs52fimq7sa6t\/512x384.jpg",
    "width": "640",
    "height": "1024"
  },
  {
    "id": "46972",
    "title": "Bock Puzzle Console",
    "description": "Water Color 2D is an educational and challenging puzzle game! This is the best free water-sorting puzzle game for you to exercise your brain, kill your free time, and relax! If you want to train your combinatorial logic skills, then this water-sorting puzzle game is for you!",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/vp8vsr4ru7rn10nf4utrwyrk7tusbvd5\/",
    "category": "Puzzle",
    "tags": ".io, Android, Brain, Educational, Fun, Skill",
    "thumb": "https:\/\/img.gamemonetize.com\/vp8vsr4ru7rn10nf4utrwyrk7tusbvd5\/512x384.jpg",
    "width": "300",
    "height": "600"
  },
  {
    "id": "47528",
    "title": "Pop It Pop It",
    "description": "Welcome to the game Pop It Pop It. Select the Pop It toy you want from the menu. Start relaxing by tapping on the Pop It toy. If you get bored with the Pop It toy, return to the menu and choose another Pop It toy. You can play unlimited with all Pop It toys. Have fun.",
    "instructions": "Click with the mouse on Pop It Tap on Pop It for mobile devices with your finger ",
    "url": "https:\/\/html5.gamemonetize.com\/w8jdx0bfqkosta9kzcm9q6gid2hpcbwz\/",
    "category": "Clicker",
    "tags": "Android, Baby, Bubble, Click, Clicker, Cool, Cute, endless, Girl, Girls, HTML, HTML5, Magic, Mobile",
    "thumb": "https:\/\/img.gamemonetize.com\/w8jdx0bfqkosta9kzcm9q6gid2hpcbwz\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47536",
    "title": "Rainbow Monster VS Skibidi Toilet",
    "description": "Rainbow Monster VS Skibidi Toilet is a combination between action and stealth game. As a Rainbow Monster you must survive from hurdles of Skibidi Toilet. Take aimlessly all Skibidi Toilet enemies from behind. Dont let them catch you!",
    "instructions": "Key Left Move left Key Right Move right Key Up Jump move up Key Down Move down W A S D Camera Pan Z X attack",
    "url": "https:\/\/html5.gamemonetize.com\/cnu703sdunnure2h4yow3vc2card6msa\/",
    "category": "Hypercasual",
    "tags": "1 Player, 3D, 3D Games, Fantasy, Mario, Music, Play, Rhythm, Simulation, Skibidi Toilet, Stealth, Unity3D, WebGL",
    "thumb": "https:\/\/img.gamemonetize.com\/cnu703sdunnure2h4yow3vc2card6msa\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47534",
    "title": "Squad Goals: Soccer 3D",
    "description": "Squad Goals is fun and simple 3D soccer game that can quickly turn into a crazy ball brawl! No cards, fouls, or offsides! Slide, tackle, dribble, kick, shoot, and score &ndash;all with just one finger! Whoever scores first wins the match! Rise through the ranks to dominate the game! Key game features: &bull;One-finger on-screen joystick controls, with support for mouse and keyboard &bull;Upgrade character traits to unlock full potential &bull;Level up to rise through the ranks &bull;Shop for cosmetics to customize your character, ball, and stadium &bull;Complete daily quests to earn more coins &bull;Daily and hourly rewards &bull;Play in two modes: ARENA or TEAM vs TEAM",
    "instructions": " bull Touch Mouse TAP CLICK and DRAG to RUN RELEASE to SLIDE SHOOT or PASS bull Keyboard Press arrow keys or WASD to RUN Release arrow keys or press SPACE to SLIDE SHOOT or PASS",
    "url": "https:\/\/html5.gamemonetize.com\/413slo2x1o8km5rs8vb6ikya691zsm78\/",
    "category": "Soccer",
    "tags": "3D, Alien, Android, Animal, Ball, Basketball, Football, Robot, Skill, Soccer, Sport, Sports, Tennis, Zombie",
    "thumb": "https:\/\/img.gamemonetize.com\/413slo2x1o8km5rs8vb6ikya691zsm78\/512x384.jpg",
    "width": "1024",
    "height": "1820"
  },
  {
    "id": "47559",
    "title": "Girls Nail Art Salon",
    "description": "Girls, are you ready to play the best nail salon game in the world? Its time to become a super nail designer in the universe and design your own nails through Girls Nail Art Salon! If you have ever tried to design your own nails, you know how difficult it is to get them right. But thanks to this amazing nail salon game, you will be able to do it in an easy way and create beautiful nail designs.",
    "instructions": "On the desktop use the mouse to tap to attach accessories to the nails On mobile use the finger to tap to attach accessories to the nails ",
    "url": "https:\/\/html5.gamemonetize.com\/pf67zhthzd2lbla4mfj7vb0tjzsglaxb\/",
    "category": "Girls",
    "tags": "Fashion, Fun, Girls, HTML5, Jewel, Kids, Makeover, Mobile, Nails",
    "thumb": "https:\/\/img.gamemonetize.com\/pf67zhthzd2lbla4mfj7vb0tjzsglaxb\/512x384.jpg",
    "width": "504",
    "height": "800"
  },
  {
    "id": "47560",
    "title": "Archer Huntsman Game",
    "description": "Archer Huntsman is a fun confrontation arcade game. You can either choose the parkour hunting mode or the endless breakout mode. In parkour hunting mode, you need to survive to the end with your skills within the time limit. In the endless mode, you need to protect the king, if the king dies you will also fail. You can use the reward for passing to unlock new characters and skills. Have fun!",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/fz1bcz13appypcqium28h4eohm3sdg25\/",
    "category": "",
    "tags": "3D, Arcade, Avoid, Fighting, Kid, Killing, Skill",
    "thumb": "https:\/\/img.gamemonetize.com\/fz1bcz13appypcqium28h4eohm3sdg25\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "46836",
    "title": "Little Girls School vs PrincessStyle",
    "description": "Come and join this wonderful dressup game at 7sgames.com. These little girls, Sophia and Clara to get dressed in princess style and school style. Of course the both good at these outfits. Lets check who is best in these outfits.",
    "instructions": "Use mouse to control by clicking each button or icon in the game",
    "url": "https:\/\/html5.gamemonetize.com\/3nn4slcv5ceftlgap6ty11857g2uzjnl\/",
    "category": "Girls",
    "tags": "Collection, Dress Up, Makeover",
    "thumb": "https:\/\/img.gamemonetize.com\/3nn4slcv5ceftlgap6ty11857g2uzjnl\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "46581",
    "title": "Mini Dash",
    "description": "Mini Dash is a retro-style platform game where you command a small blob character; use his air-dashing skills to evade obstacles and collect the level coins! Also, you have a speedrun mode to test your skills.",
    "instructions": "Desktop -X Left Click C or Right Click to Jump -X or Left Click in the air to Dash Left -C or Right Click in the air to Dash Right Mobile -Touch Left or Right to Jump -Touch Left in the air to Dash Left -Touch Right in the air to Dash Right ",
    "url": "https:\/\/html5.gamemonetize.com\/fvqazkrlhtsw9ad3bcz0fbslwh100qf4\/",
    "category": "Arcade",
    "tags": "Action, Arcade, Pixel, Platform, Retro",
    "thumb": "https:\/\/img.gamemonetize.com\/fvqazkrlhtsw9ad3bcz0fbslwh100qf4\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47570",
    "title": "School Life",
    "description": "The life of a high school student is full of interesting events and trials! You have to constantly make a choice on which your whole future life will depend. Will you be the main school ringleader or a quiet honors student? Will you skip classes and go to the disco or stay at home to study for the exam? Will you be kicked out of the house and will you turn into a bum or become a millionaire? If you are unhappy with your life, you can go back in time and change everything by making a different choice!",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/0w0vg2jg8c7xejqz6hdk788b6jpvj0cv\/",
    "category": "Adventure",
    "tags": "Anime, Click, Interactive Fiction, School",
    "thumb": "https:\/\/img.gamemonetize.com\/0w0vg2jg8c7xejqz6hdk788b6jpvj0cv\/512x384.jpg",
    "width": "960",
    "height": "600"
  },
  {
    "id": "47507",
    "title": "Ice Scream: Horror Escape",
    "description": "Ice Scream: Horror Escape is an exciting and scary adventure puzzle game. One day morning, you saw your best friend being kidnapped by a strange man into the ice cream truck. You need to rescue children in danger and escape from the evil ice cream truck driver. Do you have the courage to take on the challenge?",
    "instructions": "1 Use WASD or the joystick to move 2 Press the button to interact with the scene 3 Escape from the Ice Cream Trucker and save your friend ",
    "url": "https:\/\/html5.gamemonetize.com\/7jz6aysjuk90clvhm2us38y3mkdr3e8w\/",
    "category": "Boys",
    "tags": "3D, Adventure, Boy, Brain, Escape, HTML5, Puzzle, Strategy",
    "thumb": "https:\/\/img.gamemonetize.com\/7jz6aysjuk90clvhm2us38y3mkdr3e8w\/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "47419",
    "title": "Princesses As Ancient Warriors",
    "description": "Welcome to the Princesses As Ancient Warriors. Princesses Anna, Elsa, Ariel, and Moana are best friends, they love to be ancient warriors in feature. But these girls don &rsquo;t want to wait as long. They planned to try cool warrior costumes and be like them now. Help the girls to browse their wardrobes. Join and have fun!",
    "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
    "url": "https:\/\/html5.gamemonetize.com\/qlz9dzhinx6l4rdrc57alojy3yaqhw7y\/",
    "category": "Girls",
    "tags": "Dress Up, Fashion, Girls, Princess",
    "thumb": "https:\/\/img.gamemonetize.com\/qlz9dzhinx6l4rdrc57alojy3yaqhw7y\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "39985",
    "title": "Garden match saga",
    "description": "Garden Match Saga is a match 3 puzzle game where you have to match multiple types of fruits to progress. What you have to do is to position at least 3 or more similar fruits on the same line to clear them and succeed in reaching the objectives set for each level. You have 3 objectives per level. The game has 400 very interesting levels. Good luck with the game.",
    "instructions": "Use mouse and touch",
    "url": "https:\/\/html5.gamemonetize.com\/2w2pbkz7y4t6jl2ipww90jw2c6b0c4w6\/",
    "category": "Puzzle",
    "tags": "Arcade, Candy, Fruits, Fun, Girls, HTML5, Logical, Match-3, Matching, Skills",
    "thumb": "https:\/\/img.gamemonetize.com\/2w2pbkz7y4t6jl2ipww90jw2c6b0c4w6\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "43257",
    "title": "Mia Beach Spa",
    "description": "Lets help this gorgeous girl Mia to have the wonderful spa day at beach, that must be release her stress from her routine princess job and relax her mind and body to get refresh. She needs complete back spa and facial treatments, Come and join this makeover game at 7sgames.com",
    "instructions": "Use mouse to control",
    "url": "https:\/\/html5.gamemonetize.com\/pm23px3m0xuk16zjsn880xr0tyd0dhfz\/",
    "category": "Girls",
    "tags": "Dress Up, Funny, H5, Makeover",
    "thumb": "https:\/\/img.gamemonetize.com\/pm23px3m0xuk16zjsn880xr0tyd0dhfz\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "46728",
    "title": "Ava Throat Infection",
    "description": "Lets enjoy the doctor game at 7sgames.com. Ava is the beautiful young and charm girl. But she has some infection on her throat and she is suffering a lot. She need your help to heal this. Would be the doctor for Ava?",
    "instructions": "Use mouse to control by clicking each button or icon in the game",
    "url": "https:\/\/html5.gamemonetize.com\/r56u16pwv77yrkelvps4joe6vb1rb7go\/",
    "category": "Girls",
    "tags": "Doctor, Fantasy, Surgery",
    "thumb": "https:\/\/img.gamemonetize.com\/r56u16pwv77yrkelvps4joe6vb1rb7go\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "46610",
    "title": "Hot Air Balloon Game",
    "description": "Fly your hot air balloon over the ocean by tapping the game screen to move your balloon up. Avoid obstacles such as birds and planes. Also avoid landing the ocean and avoid hitting the boats. Dont crash your balloon or its game over!",
    "instructions": "Mouse click or tap to play Avoid obstacles Dont crash your balloon or its game over ",
    "url": "https:\/\/html5.gamemonetize.com\/1vnequr3pabvkw585kjhzgv79bt4cpkw\/",
    "category": "Arcade",
    "tags": "Action, Aircraft, Arcade, Ballon, Bird, Casual, Clicker, Game",
    "thumb": "https:\/\/img.gamemonetize.com\/1vnequr3pabvkw585kjhzgv79bt4cpkw\/512x384.jpg",
    "width": "1366",
    "height": "768"
  },
  {
    "id": "45740",
    "title": "Mahjong Tiles",
    "description": "Play the real Mahjong puzzle game. Match up traditional Mahjong tiles until all of tiles are gone in this authentic Chinese style board game. Unlock new levels and zoom into the field, speeding through levels in a bid to become the real Mahjong Ace!",
    "instructions": "Mouse",
    "url": "https:\/\/html5.gamemonetize.com\/8ixrfv673ox0ksq9pb66t4yq4f6r0yn3\/",
    "category": "Puzzle",
    "tags": "Mahjong",
    "thumb": "https:\/\/img.gamemonetize.com\/8ixrfv673ox0ksq9pb66t4yq4f6r0yn3\/512x384.jpg",
    "width": "800",
    "height": "480"
  },
  {
    "id": "47024",
    "title": "Babie Panoz Fighter",
    "description": "Fight with Babie Panoz in the city underground against her terrible enemy Lizy for her survival ! Combatti con Babie Panoz nei sobborghi della citt &agrave;contro la sua temibile avversaria Lizy per la sua sopravvivenza !",
    "instructions": "INSTRUCTIONS Tap or Button Kick or key A Panoz Kick Button Pause or key D Pause Button Back or key S Back Button Forward or key W Forward",
    "url": "https:\/\/html5.gamemonetize.com\/kxx30cbb2qghgve0mnxnt04huxcud927\/",
    "category": "Girls",
    "tags": "Fighting, Game, HTML5",
    "thumb": "https:\/\/img.gamemonetize.com\/kxx30cbb2qghgve0mnxnt04huxcud927\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47457",
    "title": "Coloring Book Super Mario",
    "description": "Coloring Book Super Mario For Kids is fun coloring book for kids and adults! If you like Super Mario characters then you will love this fun cartoon themed coloring book! Choose one of the cute images, pick your favorite color and start coloring! Enjoy it!",
    "instructions": "Just one Click Tap to play use mouse and keyboard to play ",
    "url": "https:\/\/html5.gamemonetize.com\/8j9gg42aifrn4mmp4z3mshvvsnea3dgq\/",
    "category": "Hypercasual",
    "tags": "Boys, Cartoon, Color, Coloring, HTML5, Kids, Mario, Mobile, School",
    "thumb": "https:\/\/img.gamemonetize.com\/8j9gg42aifrn4mmp4z3mshvvsnea3dgq\/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "47302",
    "title": "Everyone Flee",
    "description": "You must ensure that everyone can flee! But be aware that your moves apply to everyone. Move all the players in a way that everybody safely reaches the door. If one cannot make it, everybody fails, beware of that too.",
    "instructions": "Use WASD keys to move around avoid obstacles You can use arrow keys to move as well ",
    "url": "https:\/\/html5.gamemonetize.com\/mxr6q4l0shhi0ynnq633vvpub8h5kt4m\/",
    "category": "Hypercasual",
    "tags": "2D, Action, Adventure, Android, Guessing, Interactive, iPhone, Love, Physics, Platform, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/mxr6q4l0shhi0ynnq633vvpub8h5kt4m\/512x384.jpg",
    "width": "854",
    "height": "480"
  },
  {
    "id": "40462",
    "title": "Kittygram",
    "description": "Kitty cat need help to finish each level. Find correct possition to each block to finished and start new level. You can choose table size from 3x3 until 10x10. Goog luck.",
    "instructions": "mouse and touch",
    "url": "https:\/\/html5.gamemonetize.com\/wm43az3123kq2ecatqjuv3mmoddq1j6m\/",
    "category": "Puzzle",
    "tags": "1 Player, Arcade, Fun, Girls, Logic, Matching, Puzzle, Skills",
    "thumb": "https:\/\/img.gamemonetize.com\/wm43az3123kq2ecatqjuv3mmoddq1j6m\/512x384.jpg",
    "width": "1920",
    "height": "1920"
  },
  {
    "id": "46405",
    "title": "Hospital Hustle",
    "description": "Hospital Hustle game is a super fun management game . Take care of all your patients by accepting them , cure them in different machines . By the way you have to carry resources for machines in order to machines work. Also you can hire doctors , workers , receptionist and also upgrade your staff skills and capacities . You have happiness bar at the top and you have to keep it at maximum .",
    "instructions": "Player 1 WASD or Arrow Keys For movement Player 2 Arrow Keys For Movement",
    "url": "https:\/\/html5.gamemonetize.com\/9wwq3zj6f6e4s6r4vnki5ffk6akkz3gb\/",
    "category": "Girls",
    "tags": "2 Player, 2 Player Games, Business, Cartoon, Doctor, Management",
    "thumb": "https:\/\/img.gamemonetize.com\/9wwq3zj6f6e4s6r4vnki5ffk6akkz3gb\/512x384.jpg",
    "width": "922",
    "height": "487"
  },
  {
    "id": "47515",
    "title": "Puzzle Bobo Online",
    "description": "Play an online puzzle game called Puzzle Bobo Online. The has easy and hard levels. In the easy level, you have to drag the images to the right position to complete the game. On the hard level, the images must be moved by sliding them to the empty position till all images are in the right position. Play this game on any device and full-screen if you like it.",
    "instructions": "Mouse or finger for touch devices ",
    "url": "https:\/\/html5.gamemonetize.com\/s0hyz0k8811r2r6s9w4litg7b3so9tuo\/",
    "category": "Puzzle",
    "tags": "Girls, Jigsaw, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/s0hyz0k8811r2r6s9w4litg7b3so9tuo\/512x384.jpg",
    "width": "640",
    "height": "360"
  },
  {
    "id": "46364",
    "title": "Hexable",
    "description": "In the Hexable game your goal is to fill a board resembling a hexagon with straight rows or columns using differently shaped objects. Filling a row or column will make space for other objects and will give you points. Try to play for the best possible score!",
    "instructions": "Click and drag a piece to place it on the board Fill up a full line in any direction to clear it Keep clearing lines and try not to run out of playable moves Clear two lines in a row to earn currency and unlock a new theme ",
    "url": "https:\/\/html5.gamemonetize.com\/jop3jtwuc3x36y3309okudcphler1efy\/",
    "category": "Puzzle",
    "tags": "1 Player, Board, Brain, Family, Game, Games, HTML, HTML5, Logic, Logical, Mobile, Online, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/jop3jtwuc3x36y3309okudcphler1efy\/512x384.jpg",
    "width": "960",
    "height": "540"
  },
  {
    "id": "46657",
    "title": "PenguinDash!",
    "description": "All you have to do is get as far as you can, but watch out for the crates and explosive TNTs! Penguins cant fly, so use your jumps wisely! Game gets faster and harder the further you go! - HOW TO PLAY - Jump from one platform to another, avoiding obstacles. Collect gems to increase your score. Collect 5 diamond gems to restore health by one heart. Use gems to buy power ups. The 3 in total to choose from: - Running Shoes: Your score increases at a quicker rate. - Shield: Take one free hit without losing health - Bandana: You have the ability to triple jump!",
    "instructions": "Click to Jump A quick click will prdoce a hop jump and and long click will produce a higher longer jump Press jump anytime in mid air to double jump ",
    "url": "https:\/\/html5.gamemonetize.com\/7j68su1viy4c2av6k78yu1ea14t2vpg2\/",
    "category": "Hypercasual",
    "tags": "2D, Casual, Click, endless, Game, Highscore, jump, Jumping, Obstacle, Penguin, Platform, Play, Side Scrolling, unity",
    "thumb": "https:\/\/img.gamemonetize.com\/7j68su1viy4c2av6k78yu1ea14t2vpg2\/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "47040",
    "title": "Queen of the Maze",
    "description": "Players of all ages can enjoy the Queen of Hearts Maze Game, which is straightforward but challenging. It is a good example of a classic maze game, and it is sure to bring back memories for those who played it in the early days of PC gaming.",
    "instructions": "Desktop Use the right and left click button to move left and right Mobile swipe right left and up down to move everywhere Controls and indicators Upper left side of the screen has the pause button The scores and levels are shown in the upper middle of ",
    "url": "https:\/\/html5.gamemonetize.com\/wibe7os6k4uk5j9cmlkiwrj1zf5uo718\/",
    "category": "Puzzle",
    "tags": "2D, HTML, HTML5, Hypercasual, Mobile, Online, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/wibe7os6k4uk5j9cmlkiwrj1zf5uo718\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47357",
    "title": "Ghost Town Escape 3 &ndash;Mirrored Dimension",
    "description": "As your weary eyes flutter open, they behold a desolate realm of abandonment. A spectral gust sweeps through your ethereal frame, causing a shiver to ripple down your spine. In this forlorn necropolis, you stand solitary, bereft of mortal companionship. Your duty now unfolds before you, a quest veiled in phantasmagoric riddles. Seek out and unearth 35 mystical relics, a task that shall stir the dormant portal of escape from this spectral realm!",
    "instructions": "Mouse click or tap to play the point-and-click game ",
    "url": "https:\/\/html5.gamemonetize.com\/xkg41nyzgwyj5mol2g4artxsd1xmeutm\/",
    "category": "Puzzle",
    "tags": "Adventure, Escape, Point And Click, Room",
    "thumb": "https:\/\/img.gamemonetize.com\/xkg41nyzgwyj5mol2g4artxsd1xmeutm\/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "47518",
    "title": "Farming.IO",
    "description": "Farming.IO is a 2D arcade game that you most enjoy while playing it, its puzzle where you have to link atleast 3 same objects that are close to each other to get 500 coins get much as you can of coins before the timer ends to be able to buy some cool stuff.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/2s0mrm17o9nut5xjtzrfpilfbgestjb7\/",
    "category": "Puzzle",
    "tags": "Boys, Bricks, Clicker, HTML5, iPhone, Mobile",
    "thumb": "https:\/\/img.gamemonetize.com\/2s0mrm17o9nut5xjtzrfpilfbgestjb7\/512x384.jpg",
    "width": "300",
    "height": "600"
  },
  {
    "id": "47337",
    "title": "Handslap",
    "description": "Handslap is a game for 2 players. You can choose whatever arm you want and compete with your friends. Red side is one that is attacking, blue side need to dodge that attack. Players change sides if blue side successfully dodged. To win you need to score 10 points. You earn 1 point with each successful attack you make.",
    "instructions": "Tap on your half to attack dodge on mobile On PC you need to use W and Arrow Up keys ",
    "url": "https:\/\/html5.gamemonetize.com\/hcktfoyek2b5htexp6z645sub6kppc8b\/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Action, Arcade, Game, Games, HTML, HTML5, PvP, Skill, Skills, unity, WebGL",
    "thumb": "https:\/\/img.gamemonetize.com\/hcktfoyek2b5htexp6z645sub6kppc8b\/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "47533",
    "title": "Super Spy Mario VS Skibidi Toilet",
    "description": "Super Spy Mario VS Skibidi Toilet is a combination between action and stealth game. As a Super Spy Mario you must survive from hurdles of Skibidi Toilet. Take aimlessly all Skibidi Toilet enemies from behind. Dont let them catch you! Game features: - Map design each level is unique and has its own strategies to complete - The cool feeling of stealth 2.5D action packed game - Cool environment and enemy AI",
    "instructions": "PC LAPTOP CONTROLS Key Left Move left Key Right Move right Key Up Jump move up Key Down Move down W A S D Camera Pan Z X attack MOBILE CONTROLS Use in game button on the screen",
    "url": "https:\/\/html5.gamemonetize.com\/qmge8jsxyuoxtxsuwtizlhyilhp6ogfb\/",
    "category": "Adventure",
    "tags": "1 Player, 3D, 3D Games, Arcade, Mario, Mobile, Skibidi Toilet, Stealth, Unity3D",
    "thumb": "https:\/\/img.gamemonetize.com\/qmge8jsxyuoxtxsuwtizlhyilhp6ogfb\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47527",
    "title": "Skibidi Toilet vs Wario",
    "description": "Skibidi Toilet vs Wario is an amazing ans super fun running game that you can play online for free. Its in HTML5, No Need to Install! The aim of the game is to win the race, you as a Skibidi Toilet vs Wario! Collect boost to run extra fast. have fun playing!",
    "instructions": "Arrow keys or WAD to play ",
    "url": "https:\/\/html5.gamemonetize.com\/h7n4mqfxk6143vxdktdgdsxszgkve7jg\/",
    "category": "Arcade",
    "tags": "Android, Arcade, Avoid, Boy, Fun, HTML5, Hypercasual, jump, Jumping, Mario, Obstacle, run, running, Skibidi Toilet",
    "thumb": "https:\/\/img.gamemonetize.com\/h7n4mqfxk6143vxdktdgdsxszgkve7jg\/512x384.jpg",
    "width": "854",
    "height": "480"
  },
  {
    "id": "47547",
    "title": "Hexa 2048 Puzzle   Block Merge",
    "description": "&ldquo;Hexa 2048 Puzzle &rdquo;is an addictive relaxing number block merge game. Come to play Hexa Puzzle, merge the Hexa blocks and give your brain a rest! Features: Beautifully easy and simple, no pressure and no time limit. Challenging to break your highest score. Easy to play. Classic merge game and block game for all ages! Multiple beautiful background pictures. Multiple materials of blocks. Such as: iron, crystal, wood &hellip;Come and play this game and become a master of Hexa Block Merge Game now!",
    "instructions": " Drag the Hexa Blocks to move them The same Blocks will be merged to a larger number block The Hexa Blocks can be rotated ",
    "url": "https:\/\/html5.gamemonetize.com\/vrwtg1qhbkcyu7rt0eewx89dxmcdn6tv\/",
    "category": "Puzzle",
    "tags": "1 Player, 2D, Brain, Clicker, Collection, Funny, Games, Match 3, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/vrwtg1qhbkcyu7rt0eewx89dxmcdn6tv\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47372",
    "title": "Merge Bubble Number",
    "description": "Merge Bubble Number is a simple and addictive number merge puzzle game. You will control a board of checkers, each with a bubble with a number in it. You need to connect as many bubbles as possible so that bubbles of the same number merge together. The goal of the game is to merge as many bubbles as possible before there are no bubbles that can be synthesized, and finally reach a high score.",
    "instructions": "1 Use the mouse to drag You can also tap the screen to control on mobile devices 2 The game requires you to use mathematical thinking and strategies flexibly and arrange every move reasonably 3 You need to predict the merged numbers and choose the a",
    "url": "https:\/\/html5.gamemonetize.com\/2hy8rlzvcdrj7z84145tf9jhcubbd5is\/",
    "category": "Boys",
    "tags": "Boy, Brain, Bubble, Fun, HTML5, Kid, Kids, Mobile, Number, Online, Puzzle, Strategy",
    "thumb": "https:\/\/img.gamemonetize.com\/2hy8rlzvcdrj7z84145tf9jhcubbd5is\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47545",
    "title": "Ball Color 3D Game",
    "description": "The objects in Ball Color3D are composed of various geometric shapes, including common spheres, cubes, and rhomboids, as well as various irregular 3D shapes. Adjust the angle by touching the screen, shoot the small ball to the part corresponding to the 3D shape, and color the small ball around the shooting target. Gorgeous colors and unlimited levels will show you the beauty of the game!",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/n8ltoidf43w48srnsgkideom17w0qzxl\/",
    "category": "",
    "tags": "3D, Ball, Boy, Brain, Kids, Puzzle, Skills",
    "thumb": "https:\/\/img.gamemonetize.com\/n8ltoidf43w48srnsgkideom17w0qzxl\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "47417",
    "title": "Crazy car transport truck",
    "description": "In this Advance Truck driving game your task is to move loads of freight things starting with one spot then onto the next inside city. You need to appreciate off-road Driving game while driving the truck in mountains valleys and escalate the rush of slope ascending test on troublesome rough terrain tracks in police car driver challenge game.",
    "instructions": "Use keyboard arrows to control truck and other vehicles",
    "url": "https:\/\/html5.gamemonetize.com\/1rrpv2bnffkj89bpvjszjwyyyj0ft8mo\/",
    "category": "Adventure",
    "tags": "3D, Army, bus, Helicopter, HTML5, monstertruck, transport, Truck, Unity3D",
    "thumb": "https:\/\/img.gamemonetize.com\/1rrpv2bnffkj89bpvjszjwyyyj0ft8mo\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "43551",
    "title": "Preschool Math",
    "description": "The objective of the game is to help players learn basic math concepts, such as counting, addition, subtraction, and shapes. PC: tap the right button of the mouse to solve the math correctly. Mobile: Touch the correct ans to the showing calculationon the screen and skill up. brain development.",
    "instructions": "PC tap the right button of the mouse to solve the math correctly Mobile Touch the correct ans to the showing calculationon the screen and skill up brain development ",
    "url": "https:\/\/html5.gamemonetize.com\/42bv4moq1k7xkkp2u1xongzk8qqjq8io\/",
    "category": "Puzzle",
    "tags": "Educational, endless, HTML, HTML5, Math, Online, School",
    "thumb": "https:\/\/img.gamemonetize.com\/42bv4moq1k7xkkp2u1xongzk8qqjq8io\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "46678",
    "title": "Snakes &amp;Ladders",
    "description": "one hundred squares full of traps and tricks Roll the dice and try you luck ladders will take you up but snakes will take you down ! This is a great game for a 100 day party! This game can be played atleast 2 players.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/4z7sfy67x4agxldckygr8twlwxghzvy5\/",
    "category": "Multiplayer",
    "tags": "2 Player, Action, Adventure, Android, HTML5, Hypercasual, iPhone, Multiplayer",
    "thumb": "https:\/\/img.gamemonetize.com\/4z7sfy67x4agxldckygr8twlwxghzvy5\/512x384.jpg",
    "width": "300",
    "height": "600"
  },
  {
    "id": "46878",
    "title": "Coloring books",
    "description": "Coloring books is a free online coloring and kids game! In this game you will find different books pictures which have to be colored as you want. You have the enough amount of colors to choose for your perfect art. You can also save the colored image. Have fun!",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/rvyjptyd1lhrfwbw2x3hveyb8kxont2s\/",
    "category": "Girls",
    "tags": "Android, Color, Coloring, Fun, Girls, HTML5, iPhone, Kids, Mobile",
    "thumb": "https:\/\/img.gamemonetize.com\/rvyjptyd1lhrfwbw2x3hveyb8kxont2s\/512x384.jpg",
    "width": "300",
    "height": "600"
  },
  {
    "id": "47477",
    "title": "Avoid the Sharks",
    "description": "You went out swimming in the ocean, but hadnt realized until you were already in the water that there were a lot of sharks nearby. Touch the game screen to move right and left to avoid the sharks so you dont get eaten!",
    "instructions": "Touch the game screen to move right and left to avoid the sharks If on a desktop use the mouse to move the swimmer right and left ",
    "url": "https:\/\/html5.gamemonetize.com\/u2rjkywt9c1yuw51vutja0kv3wnh4okq\/",
    "category": "Arcade",
    "tags": "Mobile, Shark",
    "thumb": "https:\/\/img.gamemonetize.com\/u2rjkywt9c1yuw51vutja0kv3wnh4okq\/512x384.jpg",
    "width": "480",
    "height": "864"
  },
  {
    "id": "47473",
    "title": "Private Zombie Wave 2",
    "description": "A very smooth and precise 3rd person zombie shooter game",
    "instructions": "A Move Left D Move Right S Hide Space Shoot P Pause Or screen controller",
    "url": "https:\/\/html5.gamemonetize.com\/yjmqujr6ywps0j7i6y1b2wtiw5gywnn0\/",
    "category": "Shooting",
    "tags": "Shooter, Shooting, Zombie",
    "thumb": "https:\/\/img.gamemonetize.com\/yjmqujr6ywps0j7i6y1b2wtiw5gywnn0\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47431",
    "title": "Pixel Pulling",
    "description": "Engage in an exhilarating rope pulling race and demonstrate your superiority by emerging victorious in five rounds. May luck be on your side as you embark on this thrilling and enjoyable the challenge!",
    "instructions": "Controls for the computer The W key makes the red character pull the rope the up arrow key makes the blue character pull the rope On touch devices The red and blue buttons on the screen make the character pull the string ",
    "url": "https:\/\/html5.gamemonetize.com\/saezdmha5ddhhwkvk2y29kyrq81dxwuy\/",
    "category": "Multiplayer",
    "tags": "2 Player, 2 Player Games, Click, Multiplayer",
    "thumb": "https:\/\/img.gamemonetize.com\/saezdmha5ddhhwkvk2y29kyrq81dxwuy\/512x384.jpg",
    "width": "1000",
    "height": "1000"
  },
  {
    "id": "47354",
    "title": "Super Mario Wonder",
    "description": "Super Mario Wonder is an exciting online game set in the magical world of Mario, where players embark on an epic journey to help Mario conquer various castles. Offering an engaging mix of action and fun, this game has become a favorite among casual gamers seeking thrilling gameplay without the need for downloads or installations. Best of all, Super Mario Wonder can be enjoyed entirely for free on the popular gaming platform, kiz10.com. Casual gamers are often drawn to games that provide instant entertainment without the complexities of traditional titles. Super Mario Wonder perfectly caters to this audience, delivering a seamless and enjoyab",
    "instructions": "PC controls Use the mouse to jump Touch controls touch the screen to jump",
    "url": "https:\/\/html5.gamemonetize.com\/zk99zkldgfzm89l2g56hhf5rfzitm9x8\/",
    "category": "Clicker",
    "tags": "kiz10, Mario, Platform, run",
    "thumb": "https:\/\/img.gamemonetize.com\/zk99zkldgfzm89l2g56hhf5rfzitm9x8\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47525",
    "title": "MonkeyMart Game",
    "description": "Monkey Mart is a very fun management game. Monkeys need a grocery store for shopping. Open your mini market right now. What is their favorite food? Of course, you should start growing bananas first. Collect the ripening bananas and place them on the counter. Here, the customers have already started to arrive. Collect the eggs of the chickens you feed with bananas and place them on the counter as well. Start selling food such as banana puree canned food, flour, bread, and milk with the money you have saved. Lets run to the most fun of shopping!",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/kv55oxvots5vb1cl3g17te2xitdwgxpe\/",
    "category": "",
    "tags": "Boy, Decoration, Fun, Highscore, Kid, Puzzle, Skill",
    "thumb": "https:\/\/img.gamemonetize.com\/kv55oxvots5vb1cl3g17te2xitdwgxpe\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47224",
    "title": "My Sweet Candy Outfits",
    "description": "Welcome to the My Sweet Candy Outfits. Rainbow high girls Skyler, Sunny, Ruby, and Violet are planning a weekend party. But a party without a theme is not fun! So they planned to be in Sweet candy themes. Help the girls to browse the wardrobe and pick the cute candy outfit for them. Play and have fun!",
    "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
    "url": "https:\/\/html5.gamemonetize.com\/57h9fa0af8sl60ju6pnh3utyyst4oebr\/",
    "category": "Girls",
    "tags": "Cute, Dress Up, Fashion, Girls",
    "thumb": "https:\/\/img.gamemonetize.com\/57h9fa0af8sl60ju6pnh3utyyst4oebr\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47502",
    "title": "Home Defense Zombie Siege",
    "description": "Home Defense Zombie Siege is a thrilling tower defense game that has taken the gaming world by storm. The game begins with a peaceful home that is suddenly under attack by hordes of terrifying zombies that threaten to destroy everything in their path.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/n31s33uesmu0ymd3sss4955m963p0bxu\/",
    "category": "",
    "tags": "Defense, Kid, Strategy, Tower Defense, Zombie",
    "thumb": "https:\/\/img.gamemonetize.com\/n31s33uesmu0ymd3sss4955m963p0bxu\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "47500",
    "title": "Skibidi Toilet Jigsaw Puzzle 2",
    "description": "The most popular jigsaw puzzle game comes back with season 2! Skibidi Toilet Jigsaw Puzzles is a unique and funny jigsaw puzzle online game that features popular Skibidi hot-themed elements. If you are seeking interesting puzzle games, you cant miss it.",
    "instructions": "1 Use the mouse or finger to drag on the screen to finish the jigsaw puzzle 2 Featured and addictive background images 3 Easy but fun gameplay there are no age or gender restrictions and user friendly 4 Gradually increased and replayable ",
    "url": "https:\/\/html5.gamemonetize.com\/12nysmbkkltwq6w2uvmeb77k4oi8b9cw\/",
    "category": "Puzzle",
    "tags": "Brain, Casual, Funny, HTML5, Jigsaw, Kids, Matching, Skibidi Toilet",
    "thumb": "https:\/\/img.gamemonetize.com\/12nysmbkkltwq6w2uvmeb77k4oi8b9cw\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47497",
    "title": "Tank Battle Tank War",
    "description": "ake your own equipment and tanks to engage in epic battles in the hills and crush the most formidable enemies. Collect loot after each battle to upgrade your armored vehicles weapons. You can unlock new tanks and fight your own way. After each victory, you will be rewarded with countless gold coins and will rise to the position of greatest war marshal.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/h2uu6i6jr0s10xftbb2icdkb8kom40hp\/",
    "category": "Shooting",
    "tags": "Battle, Fire, Shoot, Tank, War",
    "thumb": "https:\/\/img.gamemonetize.com\/h2uu6i6jr0s10xftbb2icdkb8kom40hp\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47282",
    "title": "Cube Plus",
    "description": "Forget the existing 3 matches! Cube Plus features: &middot;Easy operation-Enjoy easily with play! &middot;Special Cube-Adds power to high scores and games! &middot;Distance Score-The deeper you go down, the higher your score!",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/rszpag6r3lld9gn0ab33ksslxqt4sb05\/",
    "category": "Puzzle",
    "tags": "Block, Hypercasual, Match3, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/rszpag6r3lld9gn0ab33ksslxqt4sb05\/512x384.jpg",
    "width": "340",
    "height": "600"
  },
  {
    "id": "47513",
    "title": "New Bottle Shooting Game",
    "description": "Bottle Gun Shooting is a new shooting operation with ultimate shooting fun and entertainment which enhances you shooting visions in free and frank manner in this bottle shooter game. Have faith in your shooting abilities and join this new application of free shooting games to expand you shooting ranges. You targeted role is to take an exact and accurate aim at your bottle target of ultimate bottle shoot 3d games.",
    "instructions": "use screen buttons to shoot with gun and use mouse",
    "url": "https:\/\/html5.gamemonetize.com\/7tcd7m0kytx8m8j7hkblc5megj70pqyi\/",
    "category": "Arcade",
    "tags": "Bubble Shooter, Games, Gun, Robot, Shooter, Shooting",
    "thumb": "https:\/\/img.gamemonetize.com\/7tcd7m0kytx8m8j7hkblc5megj70pqyi\/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "47424",
    "title": "Zomblox.io",
    "description": "Multiplayer zombie survival game! Invite friends and defeat waves of zombies. Destroy loot boxes to get more powerful weapons. Play on 3 different maps or create your own maps using the level editor.",
    "instructions": "Move - WASD ARROWS Attack - MOUSE CLICK Jump - SPACE Pickup Weapon - E Show Stats - TAB",
    "url": "https:\/\/html5.gamemonetize.com\/rha2cyp1q8590dx3imb4gx8b7p74ilo3\/",
    "category": "Multiplayer",
    "tags": ".io, .io Games, Action, Multiplayer, Online, Zombie",
    "thumb": "https:\/\/img.gamemonetize.com\/rha2cyp1q8590dx3imb4gx8b7p74ilo3\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47447",
    "title": "Tank War Machines",
    "description": "Incredibly dynamic and fun multiplayer game. Build your tank from dozens of parts, play with your friends &amp;dominate the arena - 3 vs 3 PVP action. Try different tactics and win. Choose a tank and join the battle! Tanks A Lot! features four distinct game modes: - shoot your way in a classic, adrenaline-filled Deathmatch - fight for resources in Brawl - be the last man standing in Battle Royale - play football in Tank-O-Ball, but with tanks!",
    "instructions": "The game level is to enter the battlefield operate your own tank to attack the enemy target the enemy target is a moving target For tanks and airplanes players need to pay attention to the different angles of attack and the different damage caused by ",
    "url": "https:\/\/html5.gamemonetize.com\/3ulpd2m1hkmcmaoruiq7abp1o5tlxnrw\/",
    "category": "Shooting",
    "tags": "1 Player, 2D, Action, airplane, Arcade, Battle, Gun, Tank, Tanks, War, weapons",
    "thumb": "https:\/\/img.gamemonetize.com\/3ulpd2m1hkmcmaoruiq7abp1o5tlxnrw\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "46953",
    "title": "Crazy Helicopter",
    "description": "Make the right shot without touching the ground and destroy your enemy. The one who shoots five accurate shots and destroys his enemy wins. Compete with your friends and try to shoot down his helicopter with five accurate shots. Have fun, good games.",
    "instructions": "Up arrow key symbol on mobile phones Left arrow key and D key on keyboards Good games and have fun",
    "url": "https:\/\/html5.gamemonetize.com\/zck56cadhrdfyf13bdmv76ystwho4im8\/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, airplane, Arena, endless, Fighting, fly, Helicopter, Mobile",
    "thumb": "https:\/\/img.gamemonetize.com\/zck56cadhrdfyf13bdmv76ystwho4im8\/512x384.jpg",
    "width": "480",
    "height": "240"
  },
  {
    "id": "46991",
    "title": "Pixel Ball League",
    "description": "Outshine your friends and assert your dominance by scoring five goals through precise shots. Embrace the exhilarating thrill of victory and savor the gratifying joy of outplaying your opponents at every turn. Get ready for filled with intense competition and memorable moments. Enjoy the journey!!",
    "instructions": "Keyboard You can move the blue character by pressing the W key You can move the red character by pressing the up arrow key Mobile You can move the characters with the blue and red keys on the screen ",
    "url": "https:\/\/html5.gamemonetize.com\/ea9sxvc1urr1rzjwj2ue449rcfgn7560\/",
    "category": "Sports",
    "tags": "2 Player, Ball, Football, Mobile, Sport",
    "thumb": "https:\/\/img.gamemonetize.com\/ea9sxvc1urr1rzjwj2ue449rcfgn7560\/512x384.jpg",
    "width": "834",
    "height": "548"
  },
  {
    "id": "43847",
    "title": "Brain Find: Can you find it?",
    "description": "If you are fan of tricky games, riddles, brain teasers, brain games or any other quiz game, Brain Find is one of the most choicer for you to exercise you brain. The fascinating brain puzzles would definitely surprise you: WOW! That’s amazing! This new puzzle game may break common sense and test your brain with outside the box solutions. Don’t be tricked! Just think differently and everything will help you feel refreshed! Enjoy yourself with your friends with this addictive and funny free IQ game!",
    "instructions": "Dare to break through with us Get ready to be bamboozled with all new mind twisting puzzles Combine your brain test and discovery for a brain challenge like no other ",
    "url": "https:\/\/html5.gamemonetize.com\/jciwtbfxgzykmo9w3z426rrquyhi54o6\/",
    "category": "Puzzle",
    "tags": "1 Player, 2D, Brain, Difference, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/jciwtbfxgzykmo9w3z426rrquyhi54o6\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47421",
    "title": "Hunt Skibidi Toilet",
    "description": "Hunt Skibidi Toilet game is a horror game with a character of Skibidi Toilet, and its also an action game. The game will take you to a faraway place where the Skibidi Toilet is haunting players around the world. Its an extremely scary yet enjoyable experience Skibidi Toilet that you can only get when playing this game. You have arrived at an abandoned city. To save you need to find all the weapons and escape from this cursed place. There are legends that at night a Skibidi Toilet through the area and looks for its prey. If he sees someone, he will turn into Skibidi Toilet and start catching up very fast!",
    "instructions": "READY TO FIGHT MODE Drag mouse while hold left mouse - move cursor and shoot SHOOTING MODE WASD - Character move mouse move and click - FIRE",
    "url": "https:\/\/html5.gamemonetize.com\/gg6xprmbuxfpg5iqytdiht8l4hw3uzxe\/",
    "category": "Adventure",
    "tags": "3D, Battlegrounds, demolition, Skibidi Toilet, Unity3D",
    "thumb": "https:\/\/img.gamemonetize.com\/gg6xprmbuxfpg5iqytdiht8l4hw3uzxe\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "46762",
    "title": "Ninja Block",
    "description": "A ninja who needs to complete impossible tasks. New Amazing ModesClassic, Survive, Escape, Storm, Outcast, Rampage, Deadfall, Shuttle &hellip;&hellip;More... Coming Soon! No One Dies! You have one brain, two eyes, and ten fingers. You will need all them to survive. Can you last out 10s? Helping one dude to run and jump over objects is one thing. Have you got what it takes to control 2 - 36 stickman at the same? No One Dies is a test your brain hand game. Find out which one of you can run faster without tripping!",
    "instructions": "Stretch the stick in order to reach and walk on the platforms Watch out If the stick is not long enough you will fall down --5 Awesome Game Modes --You need quick - witted --Test your brain hand --Full languages Support --SImple Control ",
    "url": "https:\/\/html5.gamemonetize.com\/i99e0jhggxucyl2jd73ustf72w2lafa8\/",
    "category": "Clicker",
    "tags": "1 Player, 2D, Arcade, Bricks, Ninja, Ninjago",
    "thumb": "https:\/\/img.gamemonetize.com\/i99e0jhggxucyl2jd73ustf72w2lafa8\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "45302",
    "title": "Color Parrot",
    "description": "Color Parrot is an amazing and free to play coloring game where No download needed to play it. A magical world where your imagination takes flight and cool images of parrot come alive with the stroke of your colors! Step into a world filled with charm, beauty, and endless possibilities as you embark on a journey of creativity and relaxation. Coloring has been proven to reduce stress and anxiety, enhance focus and concentration, and stimulate mindfulness. Play around and have fun with colorful Parrot!",
    "instructions": "Mouse to play ",
    "url": "https:\/\/html5.gamemonetize.com\/46itxreij1zlrsruvzt4otccj7jt5suf\/",
    "category": "Hypercasual",
    "tags": "Animal, Arcade, Cartoon, Coloring, Fun, Games, HTML5, Hypercasual, Online, School",
    "thumb": "https:\/\/img.gamemonetize.com\/46itxreij1zlrsruvzt4otccj7jt5suf\/512x384.jpg",
    "width": "480",
    "height": "854"
  },
  {
    "id": "47488",
    "title": "Prisoner of the dungeon",
    "description": "You are a prisoner and must escape from the dungeon. Touch arrows to move. Heart will make you gain life. Fruits will make you earn points and gain a little bit of life. Monsters will lower your life. Good luck!",
    "instructions": "Touch arrows to move ",
    "url": "https:\/\/html5.gamemonetize.com\/ehp62lmer7snkl0yxi9darb6sf4zph77\/",
    "category": "Hypercasual",
    "tags": "1 Player, Action, Adventure, Arcade",
    "thumb": "https:\/\/img.gamemonetize.com\/ehp62lmer7snkl0yxi9darb6sf4zph77\/512x384.jpg",
    "width": "320",
    "height": "480"
  },
  {
    "id": "47411",
    "title": "Kitty Rush",
    "description": "Run, chase and dash with cute Kitty Rush in a fast, fun-filled endless runner. Now please help Kitty speed, slide and dodge through wild worlds where you have to challenging obstacles and keep moving forward.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/gnvtksczpjh4jmiuobleh6k0ei6i60d6\/",
    "category": "Racing",
    "tags": "Cat, Obstacle, run, running",
    "thumb": "https:\/\/img.gamemonetize.com\/gnvtksczpjh4jmiuobleh6k0ei6i60d6\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47402",
    "title": "Pool Float Party",
    "description": "Blondie and Marie decide to have a pool party. Whats a party without cocktails? Lets make a refreshing soda, lemon, lime and mint leaf mojito together. In the meantime, Blondie is engaged in cocktails, Marie cleans up the area next to the pool. Help the girls create a unique party design. Now that everything is ready, girls can take care of themselves. Make up for each of the girls and choose the right outfit. Dont forget to complete the look with stylish accessories and choose an inflatable float of an original shape for girls.",
    "instructions": "Depending on the gaming device a computer mouse or touch on touch screens is used for control ",
    "url": "https:\/\/html5.gamemonetize.com\/wbw7p5as97hbinfau6n0e2g9ojti8ooi\/",
    "category": "Girls",
    "tags": "Celebrity, Cute, Decorate, Decoration, Design, Dress Up, Fashion, Girl, Hair, HTML5, Makeover, Red, Summer",
    "thumb": "https:\/\/img.gamemonetize.com\/wbw7p5as97hbinfau6n0e2g9ojti8ooi\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "1907",
    "title": "Friends Rainbow Survival Race",
    "description": "Survival Race: The Blue Rainbow Monster takes you on an adrenaline-fueled journey through a vibrant and enchanting world, where the formidable Blue Rainbow Monster reigns supreme. With its striking blue hue and extraordinary abilities, the monster stands out as a force to be reckoned with. As you participate in the intense Survival Race, you find yourself traversing treacherous terrains, confronting challenging obstacles, and always staying one step ahead of the relentless pursuit of the Blue Rainbow Monster. The race unfolds in a visually stunning environment, brimming with a kaleidoscope of colors and whimsical landscapes. Each corner hold",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/6fpke3eo0qsc35x2ip2d5vgjrxz7wcg3\/",
    "category": "Racing",
    "tags": "Android, HTML5, iPad, iPhone, Mobile, Monster, Racing, run, running",
    "thumb": "https:\/\/img.gamemonetize.com\/6fpke3eo0qsc35x2ip2d5vgjrxz7wcg3\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47358",
    "title": "Glamour BeachLife",
    "description": "Get ready to embrace the hottest summer trends as chic swimwear becomes the ultimate fashion statement. Whether you prefer a girly-girl casual style or want to shine at glamorous beach parties, weve got you covered. Join us in transforming cute swimsuits into breathtaking summer ensembles. Olivia, our expert fashionista, is here to share her valuable tips and tricks. Start playing the glamorous #BeachLife dress-up game for girls now, and discover how you can rock adorable swimsuits from sunrise to sunset!",
    "instructions": "Use your mouse to play this game For mobile devices tap the screen ",
    "url": "https:\/\/html5.gamemonetize.com\/nwkkvcs8kx0xopplv301r5b51p95371i\/",
    "category": "Girls",
    "tags": "1 Player, Casual, Dress Up, Fashion, Games, Girls, Holiday, HTML5, Makeover, Online, Summer",
    "thumb": "https:\/\/img.gamemonetize.com\/nwkkvcs8kx0xopplv301r5b51p95371i\/512x384.jpg",
    "width": "1024",
    "height": "768"
  },
  {
    "id": "47310",
    "title": "Scribble World Platform Puzzle Adventure",
    "description": "Embark on a delightful platform puzzle adventure with Scribble World, where you control a unique scribble character in a world made of scribbles. Solve clever puzzles, find keys, and progress through challenging levels!",
    "instructions": "How to Play Embark on a delightful adventure in Scribble World a platform puzzle game where you control a unique scribble character in a world made of scribbles Controls Use the WASD keys to navigate your scribble character Objective Your goal is to",
    "url": "https:\/\/html5.gamemonetize.com\/hxx386wjejcge3e58x9pgzcr7feu1oy9\/",
    "category": "Puzzle",
    "tags": "1 Player, 2D, Adult, Adventure, Android, Escape, Monster, Platform, Puzzle, Space",
    "thumb": "https:\/\/img.gamemonetize.com\/hxx386wjejcge3e58x9pgzcr7feu1oy9\/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "47428",
    "title": "Fight Bros",
    "description": "Have you ever thrown a stone with a slingshot before? shoot and beat your friend with slingshot. It is a game that can be played for 2 players. Fight with each other with your friend. You have 3 lives. 3 lifeless dies and loses. fight to win. There are 3 different maps. Superpowers are falling because of the sky. Get the gift box and get your power. Kill your opponent with fish oranges and stars.",
    "instructions": " Player 1 can move with the WASD keys You can shoot with the S key Player 2 can move with the Arrow Keys keys You can shoot with the Down Arrow key Mobile play is available ",
    "url": "https:\/\/html5.gamemonetize.com\/c0z600ozef8ao5r4r4d3nh5mzgsnab3n\/",
    "category": "Action",
    "tags": "2 Player, 2 Player Games, 2D, Action, Arcade, Arena, Battle, Fight, H5",
    "thumb": "https:\/\/img.gamemonetize.com\/c0z600ozef8ao5r4r4d3nh5mzgsnab3n\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47446",
    "title": "They Are Coming 3D Game",
    "description": "In this action-packed game, players will step into the shoes of a fearless warrior, ready to take on hordes of enemies. The game takes place in a vibrant and immersive 3D world, offering stunning visuals and realistic sound effects that will captivate players from the beginning.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/v3hg782f33e4eze3aivitkli2qz8cmh8\/",
    "category": "",
    "tags": "3D, Arcade, Avoid, Fight, Kid, Platform",
    "thumb": "https:\/\/img.gamemonetize.com\/v3hg782f33e4eze3aivitkli2qz8cmh8\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "47366",
    "title": "Us army car transport truck",
    "description": "US Army Car Transport Truck Game is an exhilarating virtual experience that puts you in the drivers seat of a powerful military transport truck. Get ready to embark on an action-packed journey as you assume the role of an elite Army truck driver entrusted with the crucial task of transporting various military vehicles across challenging terrains. Immerse yourself in stunningly realistic graphics and immersive gameplay as you navigate through rugged landscapes, from treacherous mountainous regions to dense forests and arid deserts. Your mission is to transport a wide range of military cars, jeeps, and armored vehicles safely to their design",
    "instructions": "use keyboard up down left and right arrows to control the vehicles",
    "url": "https:\/\/html5.gamemonetize.com\/qdngbsreegycovspssulw1ew91j8rkb3\/",
    "category": "Adventure",
    "tags": "Army, Car, Helicopter, HTML5, Parking, Stunts, transport, WebGL",
    "thumb": "https:\/\/img.gamemonetize.com\/qdngbsreegycovspssulw1ew91j8rkb3\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47298",
    "title": "Only Up!",
    "description": "Only Up! is an exciting arcade game in which you have to overcome obstacles and conquer heights. Inspired by the popular game Your task is to guide the character through a vertical labyrinth full of various obstacles. You must react quickly, jump accurately and climb up dexterously to avoid crashing into obstacles and falling down. As you progress through the various levels, you will encounter increasing difficulty and new challenges such as moving platforms and rotating obstacles.",
    "instructions": "PC Move - WASD Jump - Space Pause - P Restart - R Mobile Landscape Management is carried out by virtual joysticks on the screen",
    "url": "https:\/\/html5.gamemonetize.com\/56gnglfyvrjub5gbxbzg6x471tao89db\/",
    "category": "Arcade",
    "tags": "3D, Adventure, Arcade, Casual, Simulation",
    "thumb": "https:\/\/img.gamemonetize.com\/56gnglfyvrjub5gbxbzg6x471tao89db\/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "45799",
    "title": "Tractor Challenge",
    "description": "In the new Tractor Challenge game, you have to conduct field trials of new tractor models that will soon go on sale. Selecting a specific tractor model you will see it in front of you on the screen. The tractor will stand on the road. By pushing the gas pedal, you will ride it on a road with a difficult terrain, gradually gaining speed. You will need to deftly drive a vehicle to overcome many dangerous sections of the road and even make ski jumps. The main thing is not to let the tractor roll over, because then you will fail the test.",
    "instructions": "Desktop Arrow keys or W A S D to drive the tractor Mobile Use on-screen buttons to drive ",
    "url": "https:\/\/html5.gamemonetize.com\/fs5o27zuvaq3topxuqk7tsbry3nuvfu7\/",
    "category": "Racing",
    "tags": "1 Player, 2D, Best, Boys, Driving, HTML5, Mobile, Obstacle, Skill, Truck",
    "thumb": "https:\/\/img.gamemonetize.com\/fs5o27zuvaq3topxuqk7tsbry3nuvfu7\/512x384.jpg",
    "width": "960",
    "height": "540"
  },
  {
    "id": "46115",
    "title": "Sakora Anime Dress Up",
    "description": "Sakora Anime Dress Up is a 3D girls. Enjoy a virtual experience that allows you to unleash your creativity by designing and customizing virtual 3d girl outfits and hair styles. The game also offers amazing dances and moves for your 3D girl. Have fun!",
    "instructions": "Tap or Click to play",
    "url": "https:\/\/html5.gamemonetize.com\/l2cazn7f4np4ldwy791iimhuvl085caj\/",
    "category": "Girls",
    "tags": "3D, 3D Games, Anime, Dress Up, Fashion, Girl, Girls, Makeover",
    "thumb": "https:\/\/img.gamemonetize.com\/l2cazn7f4np4ldwy791iimhuvl085caj\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "39933",
    "title": "Penguin Splash",
    "description": "Penguin Splash is a fun and challenging online match 3 game. Link three or more penguins of the same color to make them splash and score points. Use special power-ups to clear the board and advance to the next level.",
    "instructions": "tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/56rrmas0lh58mi2oqgqg63bpz30dgxyc\/",
    "category": "Puzzle",
    "tags": "Action, Arcade, HTML, HTML5, Hypercasual, Online, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/56rrmas0lh58mi2oqgqg63bpz30dgxyc\/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "45822",
    "title": "Merge Numbers 2048",
    "description": "Do you love 2048 puzzle games? Come and enjoy our game Merge Number 2048 with simple graphics and smooth gameplay. Swipe left and right to drop the balls and start merging balls with the same number. Can you get 2048?",
    "instructions": "Swipe left and right to drop the balls",
    "url": "https:\/\/html5.gamemonetize.com\/0qhoiiohxttj13iq1kg0u0ue0kt3hzi0\/",
    "category": "Puzzle",
    "tags": "Bubble, Math, Number, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/0qhoiiohxttj13iq1kg0u0ue0kt3hzi0\/512x384.jpg",
    "width": "720",
    "height": "1200"
  },
  {
    "id": "44790",
    "title": "Hexa Word",
    "description": "Hexa Word is a skill game where you have to create words using letters from the hexa size, challenge yourself by tapping or connecting letters from different hexa letters to make valid words, score as much as possible before time run out.",
    "instructions": "Use mouse or touch on the screen ",
    "url": "https:\/\/html5.gamemonetize.com\/zox0pu15xu4dmbk5axyuj2a79qvwthhi\/",
    "category": "Hypercasual",
    "tags": "Best, Casual, Educational, HTML5, Letters, Logic, Logical, Mobile, School, Skill, Word",
    "thumb": "https:\/\/img.gamemonetize.com\/zox0pu15xu4dmbk5axyuj2a79qvwthhi\/512x384.jpg",
    "width": "1280",
    "height": "768"
  },
  {
    "id": "44721",
    "title": "Fairy of Lake Dressup",
    "description": "Lake fairy Vanessa is an amazing fairy. Her heart is full of goodness and beauty. She preserved the naturalness of the lake throughout her life. Let's dress Vanessa, who is in charge of protecting people and nature, very stylishly. Fun game.",
    "instructions": "Tap the screen to play",
    "url": "https:\/\/html5.gamemonetize.com\/zqobdkyjrifgzjsg6kz8n851x0oukaqr\/",
    "category": "Girls",
    "tags": "Decorate, Dress Up, Fairy, Fashion, Fun, Game, Girl, Girls, HTML5, Magic",
    "thumb": "https:\/\/img.gamemonetize.com\/zqobdkyjrifgzjsg6kz8n851x0oukaqr\/512x384.jpg",
    "width": "840",
    "height": "500"
  },
  {
    "id": "47280",
    "title": "Super Sliding Puzzle",
    "description": "Super Slider Puzzle is a classic sliding puzzle game that offers endless fun and challenges. In this addictive game, you need to make the red block move to the bottom designated position. And without crossing other blocks. How many steps can you complete the challenge?",
    "instructions": "1 Slide to move 2 Rearrange the blocks without crossing others 3 Think about how to win in minimum steps",
    "url": "https:\/\/html5.gamemonetize.com\/ra21wx4grsjaxvbzter6m2j567xp990m\/",
    "category": "Puzzle",
    "tags": "Arcade, Block, Boy, Brain, Casual, Fun, HTML5, Kids, Mobile, Puzzle, Strategy",
    "thumb": "https:\/\/img.gamemonetize.com\/ra21wx4grsjaxvbzter6m2j567xp990m\/512x384.jpg",
    "width": "395",
    "height": "604"
  },
  {
    "id": "47225",
    "title": "Rainbow Girls Neon Fashion",
    "description": "Welcome to the Rainbow Girls Neon Fashion. Girls! Neon is always special and fun to wear! These Rainbow high girls are more fashionable in the latest trends. They planned to try this neon fashion. Join and help the girls with your creative ideas. Browse each wardrobe and try unique costumes for each girl! Have fun!",
    "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
    "url": "https:\/\/html5.gamemonetize.com\/5jm7xnweevwsuwsebgcj62zt10otzv2h\/",
    "category": "Girls",
    "tags": "Cute, Dress Up, Fashion, Girls",
    "thumb": "https:\/\/img.gamemonetize.com\/5jm7xnweevwsuwsebgcj62zt10otzv2h\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47172",
    "title": "Color Skibidi Toilet",
    "description": "Welcome to the super fun Color Skibidi Toilet game, a magical world where your imagination takes flight and skibidi toilet come alive with the stroke of your colors! Step into a world filled with charm, beauty, and endless possibilities as you embark on a journey of creativity and relaxation. Coloring has been proven to reduce stress and anxiety, enhance focus and concentration, and stimulate mindfulness. Have fun coloring!",
    "instructions": "Mouse to play ",
    "url": "https:\/\/html5.gamemonetize.com\/osn9t5n1mcdn2x02n702coqoxt131uba\/",
    "category": "Puzzle",
    "tags": "Arcade, Boys, Coloring, Fun, Funny, HTML5, Hypercasual, Kids, Online, School, Skibidi Toilet",
    "thumb": "https:\/\/img.gamemonetize.com\/osn9t5n1mcdn2x02n702coqoxt131uba\/512x384.jpg",
    "width": "480",
    "height": "854"
  },
  {
    "id": "47388",
    "title": "Shortcut Race Game",
    "description": "Collect and obtain more bricks as you are controlling the stickman running along with the platforms, kick them all to achieve a great score! Avoid different ones, or you will lose and stop. Join the game and have a blast in Shortcut Race Game which is really a simple and time-killing game.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/ri07xc9oo8zl64wz6bf5fihult0o5eqz\/",
    "category": "",
    "tags": "3D, Arcade, Kid, Relaxation, running",
    "thumb": "https:\/\/img.gamemonetize.com\/ri07xc9oo8zl64wz6bf5fihult0o5eqz\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "47385",
    "title": "Super Hero Race",
    "description": "Overcome many obstacles and reach the finish line to win the award and become the best. Facing various obstacles, choose the right hero to get to the finish line faster. Be careful not to stumble into traps.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/edergx7hlhyz8mzvdymrqvp6yrj4q8ff\/",
    "category": "Arcade",
    "tags": "3D, Arcade, HTML5, Online",
    "thumb": "https:\/\/img.gamemonetize.com\/edergx7hlhyz8mzvdymrqvp6yrj4q8ff\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "46776",
    "title": "dunk FallBall",
    "description": "dunk BasketBall is a really simple game where you have to only left click for pc players or touch screen for mobile players to make the basketball go up to a specific direction the ball must go into the basket to go to the next level.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/5oep3jqa7ey05jzs9en7bthq199pz98z\/",
    "category": "Clicker",
    "tags": "Android, Click, Collecting, Fun, HTML5, iPhone, Kids, Mobile",
    "thumb": "https:\/\/img.gamemonetize.com\/5oep3jqa7ey05jzs9en7bthq199pz98z\/512x384.jpg",
    "width": "300",
    "height": "600"
  },
  {
    "id": "46293",
    "title": "BFF Skating Practice",
    "description": "Lets make these beautiful girls Ava and Clara to get ready for roller skating game with the playground cleaning and select the cute dresses with suitable accesseries. Come and join this dressup games at 7sgames.com",
    "instructions": "Use mouse to control by clicking each button or icon in the game",
    "url": "https:\/\/html5.gamemonetize.com\/vkbx72cd2mlem7n17ldoxf2xe0lswq1h\/",
    "category": "Girls",
    "tags": "Cleaning, Dress Up, Football",
    "thumb": "https:\/\/img.gamemonetize.com\/vkbx72cd2mlem7n17ldoxf2xe0lswq1h\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47235",
    "title": "fall heroes Guys 3d",
    "description": "Fall Heroes Guys 3D! This exhilarating game is a fantastic blend of excitement and challenges, drawing inspiration from the beloved Fall Guys. In this thrilling 3D adventure, youll plunge into a whimsical world filled with daring obstacles, wacky characters, and intense multiplayer action! Join a hilarious cast of quirky Fall Heroes Guys as they compete in gravity-defying races and mind-bending obstacle courses. Navigate through dynamic landscapes, hopping, dashing, and tumbling your way to victory. But beware, the competition is fierce, and only the most skilled and strategic players will emerge triumphant!",
    "instructions": "Joystick To move",
    "url": "https:\/\/html5.gamemonetize.com\/yocok5sw4zsau6c1881fo4znr39fx7m5\/",
    "category": "Multiplayer",
    "tags": ".io, .io Games, 3D, 3D Games, Adventure, Arcade, Arena, Battlegrounds, Multiplayer, Race, Unity3D",
    "thumb": "https:\/\/img.gamemonetize.com\/yocok5sw4zsau6c1881fo4znr39fx7m5\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47367",
    "title": "Rescue from Rainbow Monster Online",
    "description": "A small Impostor is tied up and confined to the room.He cuts the rope, rescues and collects unique skins. Simple and fun. Rescue from Rainbow Monster Online is an exciting casual puzzle game that brings the popular cut the rope concept to life. Available for free on Kiz10.com, this game offers a delightful and challenging experience for players of all ages. With its colorful visuals, engaging gameplay, and a touch of action, Rescue from Rainbow Monster Online is sure to captivate gamers seeking a fun and entertaining adventure. One of the standout features of Rescue from Rainbow Monster Online is its vibrant and captivating art style. The gam",
    "instructions": "Computer controls Use the mouse to cut the rope and free the character Touch controls Tap and slide to cut the rope and free the character ",
    "url": "https:\/\/html5.gamemonetize.com\/747v6poddba7w1b1n39dihdf6tmz34gn\/",
    "category": "Clicker",
    "tags": "cut, kiz10, Monster, Rescue",
    "thumb": "https:\/\/img.gamemonetize.com\/747v6poddba7w1b1n39dihdf6tmz34gn\/512x384.jpg",
    "width": "550",
    "height": "750"
  },
  {
    "id": "47374",
    "title": "Poor Eddie Game",
    "description": "Poor Eddie, he always gets put in the worst situations. From being thrown up in the air by a trampoline and kicked mid-air to being blown up by a bomb and thrown over large pits, Eddie never gets a break. In Poor Eddie, you take control of the man himself and must navigate each level by figuring out how to get Eddie over the finish line! There are tons of obstacles in the game like spikes and TnT, but also lots to help you like elevators or lifts to take you where you need to go! Can you protext Eddie and get him to where he needs to go?",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/w6reafq5j9uxyi8hsza6fzc6a1eu8z1c\/",
    "category": "",
    "tags": "Action, Arcade, Avoid, Funny, Physics",
    "thumb": "https:\/\/img.gamemonetize.com\/w6reafq5j9uxyi8hsza6fzc6a1eu8z1c\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47346",
    "title": "Filled Glass 5",
    "description": "Filled Glass 5 is a simple yet engaging physics-based puzzle game that challenges you to pour the water and avoid obstacles in order to fill the glass. This game not only enhances your spatial awareness and logical reasoning but also hones your critical thinking and problem-solving skills. Filled Glass 5 is a simple, enjoyable, and fast-paced physics-based puzzle game that helps train your mind and improves problem-solving skills while providing entertainment.",
    "instructions": "1 Use the mouse to pour You can also tap the screen to control on mobile devices 2 Avoid the obstacles to survive 3 Dont forget to save the water Because it is limited at each level 4 Erase those annoying fire and ice blocks in the way by the co",
    "url": "https:\/\/html5.gamemonetize.com\/vigey2dhvsva6zpbazkefpp178emymw5\/",
    "category": "Puzzle",
    "tags": "Android, Avoid, Boy, Brain, Casual, Fun, HTML5, Kids, Mobile, Obstacle, Online, Puzzle, Relaxation, Skill",
    "thumb": "https:\/\/img.gamemonetize.com\/vigey2dhvsva6zpbazkefpp178emymw5\/512x384.jpg",
    "width": "768",
    "height": "1280"
  },
  {
    "id": "47292",
    "title": "Blow Them Down",
    "description": "Blow Them Down is a Blow and Inhale Game. Player can contrl Blow and Inhale to defeat AI Player. And this Game support two Players, you can play with you friends at your Party. When you blow something into your opponents mouth, you will Win",
    "instructions": "computer Touch Key ldquo A D larr rarr rdquo to control Inhale and Blow phone Touch virtual button to control Inhale and Blow ",
    "url": "https:\/\/html5.gamemonetize.com\/9p4cyuxko6vvy292cr8y8uq9q7tuqht1\/",
    "category": "3D",
    "tags": "1 Player, 2 Player, Christmas",
    "thumb": "https:\/\/img.gamemonetize.com\/9p4cyuxko6vvy292cr8y8uq9q7tuqht1\/512x384.jpg",
    "width": "1334",
    "height": "750"
  },
  {
    "id": "45937",
    "title": "Hoops &amp;Fruits",
    "description": "Get ready for a slam dunk of fun with Hoops &amp;Fruits, the ultimate basketball puzzle game! Score points by shooting hoops and solving challenging puzzles, all while enjoying a fruity twist. With over 100 levels to play, youll never run out of excitement as you work your way through increasingly difficult challenges. Master the game by perfecting your aim and using power-ups to clear tricky obstacles. Whether youre a basketball fanatic or just looking for a fun and addictive puzzle game, Hoops",
    "instructions": "tap and drag to draw line",
    "url": "https:\/\/html5.gamemonetize.com\/lq9fckxfx08v52umn29ys5zgg2zopw2p\/",
    "category": "Sports",
    "tags": "2D, Adventure, endless, HTML, HTML5, Online",
    "thumb": "https:\/\/img.gamemonetize.com\/lq9fckxfx08v52umn29ys5zgg2zopw2p\/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "45559",
    "title": "Save My Sheep",
    "description": "Save My Sheep is the second version of the popular cute game that has made all the kids in the world fall in love with it. The gameplay consists of rescuing a little dog with the help of drawing, which is in trouble. To test your drawing skills and create key resistances around the Sheep, all you need to do is be careful and quick, because he is in great danger. Ready to save the baby? Then lets start!",
    "instructions": "Touch the screen to draw a line Hold on 10 seconds to prevent the bees from hurting Sheep ",
    "url": "https:\/\/html5.gamemonetize.com\/8ggr6r9mciywptxmto5ou1kqvd7m54wm\/",
    "category": "Puzzle",
    "tags": "Animal, Brain, Click, Clicker, Mind, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/8ggr6r9mciywptxmto5ou1kqvd7m54wm\/512x384.jpg",
    "width": "600",
    "height": "960"
  },
  {
    "id": "44691",
    "title": "My Cute Dog Daisy",
    "description": "Daisy is my favorite friend. Bought new clothes for my cute dog Daisy. Daisy loves pink and red. Let's dress her so fancy",
    "instructions": "Tap the screen to play",
    "url": "https:\/\/html5.gamemonetize.com\/bv4efioz2e4maaqz5ap1t8srv0dysigp\/",
    "category": "Girls",
    "tags": "Animal, Cartoon, Decorate, Dress Up, Fashion, Fun, Game, Games, Girl, Girls, HTML5",
    "thumb": "https:\/\/img.gamemonetize.com\/bv4efioz2e4maaqz5ap1t8srv0dysigp\/512x384.jpg",
    "width": "480",
    "height": "840"
  },
  {
    "id": "43843",
    "title": "Yatosan",
    "description": "Yatosan is a 2D cute little platformer where you have to collect the slices of cheese while avoiding the enemies, spikes, ground saws and reach the Exit door in order to go to the next level. There are 8 levels to play and the difficulty increases as you proceed.",
    "instructions": "Use WASD or Arrow keys for the player s movement Use W or Up arrow key twice for double jump ",
    "url": "https:\/\/html5.gamemonetize.com\/svsosg1djiyd6sjm3lzw89kfwauofh1s\/",
    "category": "Arcade",
    "tags": "1 Player, 2D, Adventure, Animal, Arcade, Cartoon, Collecting, Cute, jump, Jumping, Pixel, Platform, Retro",
    "thumb": "https:\/\/img.gamemonetize.com\/svsosg1djiyd6sjm3lzw89kfwauofh1s\/512x384.jpg",
    "width": "800",
    "height": "640"
  },
  {
    "id": "45150",
    "title": "Simple Snake",
    "description": "Snake game is a classic arcade-style game where the player controls a growing snake. The goal of the game is to eat as many pieces of food as possible while avoiding colliding with the walls or the snake\\\\s own body. As the snake eats the food, it grows longer, making it harder to maneuver without running into itself. The game ends when the snake collides with a wall or its own body. It is a simple yet addictive game that has been enjoyed by players for decades.",
    "instructions": "Touch Controls or Keyboard Arrow Keys",
    "url": "https:\/\/html5.gamemonetize.com\/bh2bcd2pjsmrqxpgur4myck3st8gctrj\/",
    "category": "Arcade",
    "tags": "Classic, Collecting, Highscore, Mobile, Snake",
    "thumb": "https:\/\/img.gamemonetize.com\/bh2bcd2pjsmrqxpgur4myck3st8gctrj\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47355",
    "title": "Bounce Big Online",
    "description": "Bounce Big is a challenging but super fun new arcade game! Your goal will be to cross obstacles and defeat your opponents! For this, you need to collect some items to achieve the purpose of being bounced into the sky. Although this looks very funny, Bounce Big has addictive gameplay and a 3D art style. If you like this game, dont forget to share it with friends!",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/zyvb37e49g4s76k2tryc6cs146pr2u8x\/",
    "category": "",
    "tags": "3D, Avoid, Funny, Kid, Obstacle",
    "thumb": "https:\/\/img.gamemonetize.com\/zyvb37e49g4s76k2tryc6cs146pr2u8x\/512x384.jpg",
    "width": "750",
    "height": "1224"
  },
  {
    "id": "47349",
    "title": "Baby Panda Food Party",
    "description": "Baby Panda is a food-loving bear who has a wide variety of delicious treats in his kitchen. However, today, our playful Panda is out exploring and his delightful munchies have come up with a brilliant idea. They have decided to throw a fabulous dress-up party for themselves while Baby Panda is away. But before they can commence their merrymaking, the foodie gang needs your assistance to get all dolled up in fancy attires. Will you lend a helping hand in dressing up the delightful edible ensemble? And to express their gratitude, the foodies will extend a warm invitation for you to join their exciting dress-up bash!",
    "instructions": "Use the mouse or finger to drag or click the screen to cook and decorate food ",
    "url": "https:\/\/html5.gamemonetize.com\/bwninp2a3pbcmj17art368nm0182tn2s\/",
    "category": "Girls",
    "tags": "Animal, Baby, Cook, Cooking, Cute, Educational, Food, Fruits, Fun, Girls, HTML5, Kids, Mobile, Panda",
    "thumb": "https:\/\/img.gamemonetize.com\/bwninp2a3pbcmj17art368nm0182tn2s\/512x384.jpg",
    "width": "800",
    "height": "504"
  },
  {
    "id": "47313",
    "title": "Cooking Trendy",
    "description": "Do you want your food to bring joy to everyone? Theres nothing better than cooking in your own restaurant.Let Cooking Trend make your dreams come true ??When playing Cooking Trend, you will transform into a famous chef, creating delicious dishes to satisfy diners every day.Not only that, you will receive attractive rewards after completing each mission and use them to upgrade items, build your own restaurant.",
    "instructions": "1 Delight customers with well-prepared meals 2 Upgrade your restaurant and kitchen appliances with the gold you get after each level 3 Unlock more delicious ingredients and condiments 4 Cooking games teach you how to do business and quality service 5 Ex",
    "url": "https:\/\/html5.gamemonetize.com\/docrms4jca8iu8kndsglrihp3ihf3xh8\/",
    "category": "Cooking",
    "tags": "Cooking, Food, Restaurant",
    "thumb": "https:\/\/img.gamemonetize.com\/docrms4jca8iu8kndsglrihp3ihf3xh8\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47307",
    "title": "parallel universe city adventure",
    "description": "Welcome to our groundbreaking 2D puzzle city game! Shift the cityscape, solve intricate puzzles, and unleash your creativity as the sole player. Get ready for an immersive journey through a dynamic urban labyrinth where you hold the power to reshape the metropolis. Are you up for the challenge? Lets begin.",
    "instructions": "Controls Use the WASD keys to navigate through the city W Move Up A Move Left S Move Down D Move Right Objective Your goal is to solve puzzles by shifting the citys structures and infrastructure to overcome obstacles and reach the designated target",
    "url": "https:\/\/html5.gamemonetize.com\/n57uz6npq7qcd5z3x02razxdijo3woay\/",
    "category": "Puzzle",
    "tags": "1 Player, 2D, Action, Adult, Adventure, Christmas, Guessing, iPad, iPhone, Physics, Platform, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/n57uz6npq7qcd5z3x02razxdijo3woay\/512x384.jpg",
    "width": "640",
    "height": "38"
  },
  {
    "id": "47312",
    "title": "Penguin Love",
    "description": "Penguin Love Puzzle &ndash;Template for Construct 3 is a game Arcade it &rsquo;s a classic style game, developed with Construct 3, Touch the squares and swap them to solve the puzzle and reach the penguin &rsquo;s goal. This template developed with Construct 3, has a clean and orderly code, which will make it very easy for you to reskin and publish your own game, or simply see the code and understand certain functions to implement them in your own developments. The template has beautiful graphics made with pixel art. If you &rsquo;re searching to publish hyper casual games or maybe a parent who wants to make child games, you &rsquo;ll find an easy way to start.",
    "instructions": "Touch the squares and exchange them to solve the puzzle ",
    "url": "https:\/\/html5.gamemonetize.com\/5fpw3s0ptle62eezuw4f0eszqoqztqq1\/",
    "category": "Puzzle",
    "tags": "1 Player, 2D, Adult, Adventure, Android, Arcade, Arena, iPhone, Platform, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/5fpw3s0ptle62eezuw4f0eszqoqztqq1\/512x384.jpg",
    "width": "320",
    "height": "180"
  },
  {
    "id": "47299",
    "title": "Skibidi Toilet Puzzle",
    "description": "Skibidi Toilet Puzzle is a funny jigsaw puzzle game. You can select one of the nine images and then select one of the four modes (16, 36, 64 and 100 pieces). Select your favorite picture and complete the jigsaw in the shortest time possible! Have fun and enjoy!",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/y3fs2hldpu6rdhbh5ika7ktg74o6pf7o\/",
    "category": "Puzzle",
    "tags": "Adventure, Best, Fun, Funny, Jigsaw, Kids, Skibidi Toilet, Skill",
    "thumb": "https:\/\/img.gamemonetize.com\/y3fs2hldpu6rdhbh5ika7ktg74o6pf7o\/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "47329",
    "title": "DuckWAK",
    "description": "Are you ready for the adventure of 2 duck brothers? The adventures are very challenging and extremely scary. duck brothers need to survive. Help them and get them to the finish line. Help the duck brothers with your friend. Get the star and get super power.",
    "instructions": " Use the Arrow Keys to move the Yellow Duck Use the WASD to move the Blue Duck both mobile and desktop playability ",
    "url": "https:\/\/html5.gamemonetize.com\/5fxyom8tolzclgq8l22xco0ofpo0jbhj\/",
    "category": "Adventure",
    "tags": "2 Player, 2 Player Games",
    "thumb": "https:\/\/img.gamemonetize.com\/5fxyom8tolzclgq8l22xco0ofpo0jbhj\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47265",
    "title": "Desert Building Stacking",
    "description": "Your objective is to build a bloks that reaches great heights while maintaining stability. The taller the building you build, the more points you earn. Your task is to strategically place these blocks on top of each other to construct a stable and towering structure. Take your time and carefully plan each move to ensure a stable construction. Your score is determined by the height of the bloks you manage to build. However, you can always restart the level and try again to improve your construction skills. Remember, the key to success in Desert Building Stacking is a combination of careful planning, precise block placement, and maintainin",
    "instructions": "HOW TO PLAY Press ldquo Space rdquo or touch the screen to insert a new floor ",
    "url": "https:\/\/html5.gamemonetize.com\/2trxtfcqx3eeejjyr49fb976pbq7a2ol\/",
    "category": "Hypercasual",
    "tags": "3D, Action, Bricks, endless, HTML5, Strategy",
    "thumb": "https:\/\/img.gamemonetize.com\/2trxtfcqx3eeejjyr49fb976pbq7a2ol\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "46981",
    "title": "SQUID SKIBIDI",
    "description": "SQID SKIBIDI is mixed game between each of squid game and squibidi its a really fun game where you have to drag your mouse when the green light is on to run and stand without making any move when the red light is on.",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/zc2smtbp08wzv5i69fkq5s9j1zvh6uvj\/",
    "category": "Racing",
    "tags": "Action, Adventure, Android, Brain, HTML5, iPhone, Mobile, running, Timing",
    "thumb": "https:\/\/img.gamemonetize.com\/zc2smtbp08wzv5i69fkq5s9j1zvh6uvj\/512x384.jpg",
    "width": "300",
    "height": "600"
  },
  {
    "id": "45893",
    "title": "Zombie Area",
    "description": "The numbers of zombies keep increasing day by day and the zombies have started to invade the house, you need to find the exit by clearing them all and surviving!",
    "instructions": "Touch Screen With Mouse",
    "url": "https:\/\/html5.gamemonetize.com\/9n6r71bt2anodx733obqb4rtfvqi8byl\/",
    "category": "Action",
    "tags": "Defense, Escape, Shooter, Zombie",
    "thumb": "https:\/\/img.gamemonetize.com\/9n6r71bt2anodx733obqb4rtfvqi8byl\/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "45918",
    "title": "Realistic Wheelbarrow",
    "description": "Think of a mountain and a wheelbarrow and a track with challenging obstacles, you should be able to climb that mountain with the wheelbarrow so balanced that you can reach the destination and enjoy the view!",
    "instructions": "Arrow Keys W A S D Keys And Touch Screen With Mouse",
    "url": "https:\/\/html5.gamemonetize.com\/bbxkyuh2uii2h15ex5lyv50qvxlbrpn7\/",
    "category": "Action",
    "tags": "Android, Balance, Mobile, Simulation",
    "thumb": "https:\/\/img.gamemonetize.com\/bbxkyuh2uii2h15ex5lyv50qvxlbrpn7\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47274",
    "title": "Rainbow Monster Impostor Catcher",
    "description": "Look no further than Rainbow Monster Impostor Catcher! In this thrilling game, youll take control of Rainbow Blue as you embark on a mission to capture the mischievous Among Us characters before time runs out. With its captivating gameplay and addictive challenges, Rainbow Monster Impostor Catcher guarantees hours of fun and entertainment. Whether youre a fan of strategy games, action-packed adventures, or puzzle-solving quests, this game has it all. With its intuitive controls and visually appealing graphics, its easy to immerse yourself in the vibrant world of Rainbow Blue and his quest to catch the impostors.",
    "instructions": "Computer controls Use the mouse to select items move with the WASD and Spacebar keys to attack Touch controls Tap the game buttons to move around the map and attack ",
    "url": "https:\/\/html5.gamemonetize.com\/izpx2q93ri3o86i81yqoh7zy4gj2dqqn\/",
    "category": "Hypercasual",
    "tags": "Escape, kiz10, run, Timing",
    "thumb": "https:\/\/img.gamemonetize.com\/izpx2q93ri3o86i81yqoh7zy4gj2dqqn\/512x384.jpg",
    "width": "800",
    "height": "500"
  },
  {
    "id": "47269",
    "title": "Target Triumph ",
    "description": "(60 Levels) - Welcome to an adrenaline-pumping battleground where your tactical skills and sharp wit are put to the test! In this thrilling game, you find yourself in a dynamic 2D environment, constantly on the move while facing a relentless enemy. But here &rsquo;s the twist: before you can take your shot, you must solve a mind-bending riddle cleverly placed between you and your target. Only by unraveling the riddle &rsquo;s secrets can you align your crosshairs and deliver a precise strike to eliminate your foe. you &rsquo;ll need lightning-fast reflexes, strategic thinking, and a knack for deciphering clues to emerge victorious.",
    "instructions": "Aim with the mouse cursor and shoot with the left button For Mobile Tap and hold to aim Release to shoot",
    "url": "https:\/\/html5.gamemonetize.com\/u0ss0tdywly1w683rhu75mvfrpi64mvi\/",
    "category": "Shooting",
    "tags": "Action, Hypercasual, Shoot, Shoot 'Em Up, Shooter, Shooting, Sniper, weapons",
    "thumb": "https:\/\/img.gamemonetize.com\/u0ss0tdywly1w683rhu75mvfrpi64mvi\/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "46764",
    "title": "Find 6 Differences",
    "description": "Find 6 Differences is a casual puzzle game where you need to find the differences between two seemingly identical images and spot them. The game is simple yet entertaining, with each round lasting just a few minutes, making it perfect for unwinding in your free time. Can you find out all the differences? Come and have fun!",
    "instructions": "Take a close look at these two seemingly identical images You must use your eyesight and observation skills to find out all the six differences and mark them by clicking with the left mouse ",
    "url": "https:\/\/html5.gamemonetize.com\/wb2cwnqf7vbiw802zwbg3kx5twqkyrvj\/",
    "category": "Boys",
    "tags": "Boy, Casual, Difference, Fun, HTML5, Kids, Mobile",
    "thumb": "https:\/\/img.gamemonetize.com\/wb2cwnqf7vbiw802zwbg3kx5twqkyrvj\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47035",
    "title": "Girl Money Rush",
    "description": "an exciting journey and shape your destiny by choosing from a myriad of captivating professions. In this thrilling adventure, you have the power to elevate your current career or embrace a fresh path brimming with possibilities. The ultimate goal is to reach the end of the day, but thats not all &mdash;along the way, youll encounter numerous money bills waiting to be collected. Keep your eyes peeled and seize every opportunity to amass a fortune!",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/n3u4ol4qqhs4fo2mifr6qnr18bb7r28d\/",
    "category": "Arcade",
    "tags": "Android, Collecting, iPad, iPhone, Mobile, Mouse, run, running",
    "thumb": "https:\/\/img.gamemonetize.com\/n3u4ol4qqhs4fo2mifr6qnr18bb7r28d\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47277",
    "title": "WuggyMissy Change",
    "description": "Have you ever escaped from a forest with monsters before? yes you need to collect stars in this forest. Help sisters Wuggy and Missy on their adventure in the forest. join the adventure. Protect yourself from dangers in your adventures. How many monsters are everywhere from dangers. be careful monsters can kill you. You have to reach the finish line in order. Remember time is running. If the time in the game runs out, you lose. You can play with 2 friends in turns or you can play alone. dont stop run get the stars and reach the finish line.",
    "instructions": " Use WASD Keys to move and jump Collect the yellow stars first and then the green stars in order Both mobile and desktop playability ",
    "url": "https:\/\/html5.gamemonetize.com\/p3q92k7ajuvyzkx6fvs28u41hx1v7phw\/",
    "category": "Arcade",
    "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Android, Arcade, Mobile",
    "thumb": "https:\/\/img.gamemonetize.com\/p3q92k7ajuvyzkx6fvs28u41hx1v7phw\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47118",
    "title": "Tiny Football Cup",
    "description": "Become a football legend by winning all the tournaments and matches! Unlock all the leagues and play with 28 different teams. Prove to your friends you are the number one football player. Play and Score! Endless 3 Turnaments Local Multiplayer Mode 28 Teams",
    "instructions": "Play matches and tournaments to win in-game currency and diamonds Control your team and get the ball to enemys goal Have fun with friends in the local multiplayer mode ",
    "url": "https:\/\/html5.gamemonetize.com\/dzitjk45xlzs7cmsqfo6v6vos58y4jc8\/",
    "category": "Sports",
    "tags": "2 Player, 2 Player Games, Football",
    "thumb": "https:\/\/img.gamemonetize.com\/dzitjk45xlzs7cmsqfo6v6vos58y4jc8\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47289",
    "title": "Pocket Tennis",
    "description": "Pocket Tennis is the best tennis game ever! Enjoy thrilling gameplay, beautiful graphics and pack of action! Pick your racket and choose your ball. Get ready to go onto the court in this brand new tennis game! Pocket Tennis is a great addition to the world of mobile sports games. Experience tennis like never before, in this fresh and easy to play tennis game. In Pocket Tennis you will enjoy a casual gameplay experience, while still remaining loyal to the original game. Clash with your opponents and smash hard!",
    "instructions": "For Desktop use Mouse to swipe For Mobile use touch to swipe ",
    "url": "https:\/\/html5.gamemonetize.com\/z18oyrpxlzo1c47krfwhf4wwx10nqkvw\/",
    "category": "Sports",
    "tags": "1 Player, 3D Games, Arcade, Best, Casual, Fun, Games, Hypercasual, Sports, Tennis",
    "thumb": "https:\/\/img.gamemonetize.com\/z18oyrpxlzo1c47krfwhf4wwx10nqkvw\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "44818",
    "title": "Archery Skills",
    "description": "Welcome to this amazing Archery Skills game where you have the opportunity to show your skills in shooting accuracy. This game contains many levels where you can choose characters but you have to earn enough stars to buy them. You can also upgrade your shooter.",
    "instructions": "Use mouse or touch on the screen ",
    "url": "https:\/\/html5.gamemonetize.com\/t68fhkhs7ncdb5yzqhl7mjiu4l25rfd2\/",
    "category": "Adventure",
    "tags": "1 Player, Arcade, Casual, Crazy, Fun, HTML5, Mobile, Shoot, Shooter, Skills",
    "thumb": "https:\/\/img.gamemonetize.com\/t68fhkhs7ncdb5yzqhl7mjiu4l25rfd2\/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "46056",
    "title": "Rise in Sky",
    "description": "Welcome to Rise in Sky Game! Protect fragile creatures from a variety of obstacles and falling objects. Clear your way as you reach higher and higher! Challenge your friends for the highest score or play Arcade mode to complete small missions!",
    "instructions": "Move your shield with one finger or mouse click to protect your player ",
    "url": "https:\/\/html5.gamemonetize.com\/yfecjwaf7w3gdc0krjylm7dvtkd1iphs\/",
    "category": "Arcade",
    "tags": "Arcade",
    "thumb": "https:\/\/img.gamemonetize.com\/yfecjwaf7w3gdc0krjylm7dvtkd1iphs\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47227",
    "title": "Funny Skibidi Toilet Face",
    "description": "Funny Skibidi Toilet Face is a super fun online game for kids that you can play for free. Its in HTML5, No Need to Install it! Make the funniest face of our famous Skibidi Toilet character! Play around and have fun!",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/sxpe7t5j4er3r9a0upv3kuxgf8s5emey\/",
    "category": "Hypercasual",
    "tags": "Android, Boys, Fun, Funny, HTML5, Hypercasual, Kids, Mobile, Skibidi Toilet",
    "thumb": "https:\/\/img.gamemonetize.com\/sxpe7t5j4er3r9a0upv3kuxgf8s5emey\/512x384.jpg",
    "width": "640",
    "height": "480"
  },
  {
    "id": "25700",
    "title": "Delete Story Dop Brain Puzzle",
    "description": "Delete Story - Dop Brain Puzzle is a challenging and fun online puzzle game for free. This game is designed to test the players thinking ability and reaction speed. It allows players to have a good time while searching for answers.",
    "instructions": "1 Find out the unnecessary part 2 Slide the mouse and use the soap to erase 3 Solve the tasks and find out the truth ",
    "url": "https:\/\/html5.gamemonetize.com\/228a4b6vws3urlg8a74ef8aj8cf5xboi\/",
    "category": "Boys",
    "tags": "Boy, Brain, Fun, Funny, HTML5, Kid, Mobile, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/228a4b6vws3urlg8a74ef8aj8cf5xboi\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47248",
    "title": "Stick Legions",
    "description": "Monsters have attacked your village! You are the only survivor! Are you ready to shoulder the important task of saving the village and defeating the army of monsters? Come and play Stick Legins to rescue your stickman companions, drive away monsters, and become a hero of justice!",
    "instructions": "1 Tap to move 2 Think about how to proceed to the next step 3 Rescue your companions and upgrade your strength ",
    "url": "https:\/\/html5.gamemonetize.com\/jvv9e8al0014k2s1xgwut4058ltwh8ob\/",
    "category": "Boys",
    "tags": "Battle, Boy, Fight, HTML5, Kid, Kids, Mobile, Online, Puzzle, Stickman, Strategy, War",
    "thumb": "https:\/\/img.gamemonetize.com\/jvv9e8al0014k2s1xgwut4058ltwh8ob\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "47249",
    "title": "Skibidi Toilet Shoot Out",
    "description": "Skibidi Toilet Shoot Out is super fun shooting game that you can play online for free. Its in HTMl5, No Need to Install it! The aim of the game is to shoot as many Skibidi Camerman as possible and make a highscore! Start playing and have fun!",
    "instructions": "Mouse or keyboard to play ",
    "url": "https:\/\/html5.gamemonetize.com\/xfyxid84j269wdsllylsc044vd72mlzw\/",
    "category": "Shooting",
    "tags": "Android, Arcade, Avoid, Boys, Hypercasual, Shoot, Shooting, Skibidi Toilet, Skill",
    "thumb": "https:\/\/img.gamemonetize.com\/xfyxid84j269wdsllylsc044vd72mlzw\/512x384.jpg",
    "width": "854",
    "height": "480"
  },
  {
    "id": "47244",
    "title": "Mini Tooth",
    "description": "Mini Tooth has a unique ability to teleport, allowing him to traverse the game world effortlessly with incredible speed and flexibility. The teleport ability grants the player the power to instantly move from one location to another, bypassing obstacles, enemies, and other dangers in their path. collect the keys and open the gate complete each level.",
    "instructions": "Left arrow key move left Right arrow key move right Up Arrow jump Z teleport R restart",
    "url": "https:\/\/html5.gamemonetize.com\/sbatyg3xay39ba77p7c9vau07ty04gm8\/",
    "category": "Puzzle",
    "tags": "Arcade, Jumping, Mobile, Pixel, Platform, Puzzle",
    "thumb": "https:\/\/img.gamemonetize.com\/sbatyg3xay39ba77p7c9vau07ty04gm8\/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "44226",
    "title": "Spider Solitaire Pro",
    "description": "Spider Solitaire is a card game that uses two decks of cards. The more cards, the more exciting the solitaire! You will really need to use your concentration to beat this puzzle game. This version of solitaire is different because it does not involve placing cards into foundation slots. Instead, stack the cards in the tableau in descending order to spin a spider web-like pattern. There is no need to sort by suit. This card game is challenging because it is easy to run out of moves. If you run out of moves, click the stock to add another row of cards to the stacks. Eliminate all the stacks to beat the game!",
    "instructions": "Stack the cards in the tableau in descending order Click the stock button for more cards when you run out of moves Eliminate all stacks to win ",
    "url": "https:\/\/html5.gamemonetize.com\/ljf3pomsy28z01q6lzjoa5v8q5oopqjb\/",
    "category": "Puzzle",
    "tags": "1 Player, Card, Game, Games, HTML, HTML5, Mobile, Online, Solitaire",
    "thumb": "https:\/\/img.gamemonetize.com\/ljf3pomsy28z01q6lzjoa5v8q5oopqjb\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "27261",
    "title": "Huggy ASMR Monster Makeover",
    "description": "Welcome to the wonderful world of Monster Makeover ASMR salon for monsters! If you want to have an exciting time and experience unforgettable emotions, then you have come to the right place. Monster Makeover ASMR salon for monsters is a childrens game that allows you to try yourself as a make-up artist of legendary monsters from the world of movies and games. Choose your favorite monsters, such as Huggy, Freddy, Noob, Rainbow Friends and many others, and get started. One of the features of the game is a wonderful sound background, thanks to which you can fully immerse yourself in the magical atmosphere of the game and relax.",
    "instructions": "Drag and drop cosmetics focusing on a specific stage of the game to interact with interactive elements of the game dirt scratches teeth etc ",
    "url": "https:\/\/html5.gamemonetize.com\/w4wszxd70o9xaoqnfw3umnj9gvqxazs5\/",
    "category": "Puzzle",
    "tags": "HTML5, huggy, Monster",
    "thumb": "https:\/\/img.gamemonetize.com\/w4wszxd70o9xaoqnfw3umnj9gvqxazs5\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "46308",
    "title": "Galaxy Wars",
    "description": "In the 2D space shooter Galaxy Wars Alien Shooter, waves of alien attackers must be fought while controlling a spaceship. The games levels come in a wide variety, and each one has its own unique challenges. You must use your skills and reflexes to ensure your life and the annihilation of the aliens.",
    "instructions": "Galaxy Wars Games is Easy tap to play Click up arrow keys to jump ",
    "url": "https:\/\/html5.gamemonetize.com\/m5nd4e1hbfunowpunrbc0zjap7lngxww\/",
    "category": "Adventure",
    "tags": "2D, Action, Adventure, Arcade, Gun, HTML, HTML5, Online",
    "thumb": "https:\/\/img.gamemonetize.com\/m5nd4e1hbfunowpunrbc0zjap7lngxww\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "46351",
    "title": "UFO Space Shooter 2",
    "description": "A simple space shooter in which you will shoot flying saucers of various colors. Dont let them hit your spaceship! The game gets progressively harder as more flying saucers start descending on the screen. Good luck!",
    "instructions": "Your spaceship auto shoots Move your spaceship by touching the screen and moving it left and right If on a desktop use the mouse to move your ship left and right ",
    "url": "https:\/\/html5.gamemonetize.com\/d1u8qg70j2pph8hfl814zkvidaqghl93\/",
    "category": "Arcade",
    "tags": "Shooting, Space, Spaceship",
    "thumb": "https:\/\/img.gamemonetize.com\/d1u8qg70j2pph8hfl814zkvidaqghl93\/512x384.jpg",
    "width": "480",
    "height": "854"
  },
  {
    "id": "46375",
    "title": "Messi vs Ronaldo KTT",
    "description": "Messi and Ronaldo find themselves in competition on another continent. Play this unique version of Kick Tac Toe, where you play as Messi or Ronaldo against your foe and try to win. You can also play against your friends in 2 player mode",
    "instructions": "Swipe to kick and hit blocks to reveal your teams logo",
    "url": "https:\/\/html5.gamemonetize.com\/l55plwa1pm7lz65c6wmu3bg3yk5aggsn\/",
    "category": "Soccer",
    "tags": "2 Player, Soccer, Sports",
    "thumb": "https:\/\/img.gamemonetize.com\/l55plwa1pm7lz65c6wmu3bg3yk5aggsn\/512x384.jpg",
    "width": "450",
    "height": "800"
  },
  {
    "id": "47213",
    "title": "Last World ",
    "description": "A 2D platform game is a type of video game where the main character navigates through a two-dimensional environment while avoiding obstacles and enemies. In this specific game, the main player is a young boy who is on a mission to escape the spell of witches and skeletons. There are 10 episodes in total, each one presenting new challenges and obstacles for the player to overcome. The young boy must avoid contact with the witches and skeletons, as touching them will result in game over. To navigate through the environment, the boy must be careful to avoid wooden and metal stakes that are scattered throughout the levels. These stakes can obstr",
    "instructions": "Up Right Left Arrow to move and to Shot the gun Click Left Mouse Button - By the way watch out for the witch and the skeleton",
    "url": "https:\/\/html5.gamemonetize.com\/ddhn38ohhoqlfuamqme6y51ae2srjtqd\/",
    "category": "Shooting",
    "tags": "1 Player, Action, Adventure, Boy, Game, World",
    "thumb": "https:\/\/img.gamemonetize.com\/ddhn38ohhoqlfuamqme6y51ae2srjtqd\/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "47200",
    "title": "Parking Out JumpGame",
    "description": "Park Out is a de-congesting, car un-jamming game where the goal is to get all of the cars out of the parking spaces without hitting into anything! Each new level brings a new challenge with different vehicles, obstacles, and solutions. Can you fit the huge lorry through the hole in the wall to give space to the tiny hatchback? Test your spacial awareness skills and get everyone out of their stuck situations!",
    "instructions": "Mouse click or tap to play",
    "url": "https:\/\/html5.gamemonetize.com\/bvorb8uvxwn5hmhxm95wqv9cqwn3h5t6\/",
    "category": "3D",
    "tags": "Mouse, Parking, Puzzle, Skill",
    "thumb": "https:\/\/img.gamemonetize.com\/bvorb8uvxwn5hmhxm95wqv9cqwn3h5t6\/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "47193",
    "title": "Zombie Day",
    "description": "Zombie Day is a Zombies gameThe player will play the role of an officerthe player cane knock down zombies to obtain resourcesand upgrade various base equipment Feature: 1Player can shoot down the zombie 2: The game &lsquo;s weapon include the UAV Mine, And many firearms 3: Defeating boss can challenge higher difficulty",
    "instructions": "computer you can click on the screen to control the protagonists movement by you mouse phone you can click on the screen to control the protagonists movement by you hand ",
    "url": "https:\/\/html5.gamemonetize.com\/auoime421spx19so4r9bvghillz15sm8\/",
    "category": "Action",
    "tags": "1 Player, 3D, Zombie",
    "thumb": "https:\/\/img.gamemonetize.com\/auoime421spx19so4r9bvghillz15sm8\/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "47046",
    "title": "Idle Mine &amp;Merge",
    "description": "Dig into the mines and get deep discovering all the blocks that are underground, defeat various enemies and bosses to earn money and buy new weapons and tools to dig, merge them with each other and make them stronger!",
    "instructions": "- Click on enemies to kill them - Buy new weapon and tools - Click start to start digging",
    "url": "https:\/\/html5.gamemonetize.com\/akqvrchqz6x75fqi4p0gt1wzq4hoidus\/",
    "category": "Hypercasual",
    "tags": "2D, Block, Casual, Clicker, Collecting, Hypercasual, Mine, Minecraft, Miner",
    "thumb": "https:\/\/img.gamemonetize.com\/akqvrchqz6x75fqi4p0gt1wzq4hoidus\/512x384.jpg",
    "width": "960",
    "height": "540"
  },
  {
    "id": "46998",
    "title": "Car Avoid Game",
    "description": "A car avoid game in which you must avoid the other cars on the road as well as the pedestrians. If you hit 3 cars its game over! If you hit a pedestrians the police will come after you. You can try to avoid the police if you can, but otherwise its game over!",
    "instructions": "Touch or use the mouse to move the car left or right to change lanes so that you avoid the oncoming traffic and pedestrians ",
    "url": "https:\/\/html5.gamemonetize.com\/58k2sizfjc4jarv0ai7psakhx9wukcv8\/",
    "category": "Racing",
    "tags": "Arcade, Avoid, Car, Driving, Hypercasual",
    "thumb": "https:\/\/img.gamemonetize.com\/58k2sizfjc4jarv0ai7psakhx9wukcv8\/512x384.jpg",
    "width": "480",
    "height": "864"
  },
  {
    "id": "47217",
    "title": "Makeover Asmr",
    "description": "Indulge in a doubly soothing experience with a mesmerizing combination of gaming and ASMR in Makeover ASMR. Unwind as you immerse yourself in the realm of skincare, aiding both girls and boys in tackling acne, uneven skin tone, and dullness. Listen to the satisfying sound of acne being gently squeezed while helping them achieve a flawless complexion. Dive into the world of fashion makeup, using an array of diverse cosmetics to create stunning looks.",
    "instructions": "As a makeup game it offers a variety of cosmetic tools to choose from allowing you to complete all the makeup steps with just one finger or mouse ",
    "url": "https:\/\/html5.gamemonetize.com\/se45f3kvmucn2cjzr8h77u9rm6tlgimt\/",
    "category": "Girls",
    "tags": "Fashion, Fun, Girls, Hair, HTML, Kids, Makeover, Mobile, Relaxation, Surgery",
    "thumb": "https:\/\/img.gamemonetize.com\/se45f3kvmucn2cjzr8h77u9rm6tlgimt\/512x384.jpg",
    "width": "504",
    "height": "800"
  },
  {
    "id": "47223",
    "title": "Bffs Rainbow Fashion Addict",
    "description": "Welcome to the Bffs Rainbow Fashion Addict. Bffs Skyler, Sunny, Ruby, and Violet are more interested to try rainbow fashion outfits. They are more attractive, elegant, and beautiful to wear. These girls already fulfilled their wardrobes with the latest collection, but they have been confused to choose the better one. Join as a design expert and help the girls to give their stunning look. Have fun!",
    "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
    "url": "https:\/\/html5.gamemonetize.com\/vrwmde919te8r6aq3s6su1osvgu1n2tg\/",
    "category": "Girls",
    "tags": "Dress Up, Fashion, Girls",
    "thumb": "https:\/\/img.gamemonetize.com\/vrwmde919te8r6aq3s6su1osvgu1n2tg\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "44514",
    "title": "Black Clover Jigsaw Puzzle",
    "description": "Zazgames is a place where you can infinitely play assembling online jigsaw puzzles. We hope you are up for another game from the Puzzle category on our website because we have just added the game called Black Clover Jigsaw Puzzle for you all, which, despite being one of the many puzzle games we have added so far into this category, this is the first puzzle game to use this specific format, and image, so it is going to be a brand new experience for all of you, an experience we are sure you will appreciate, as there is no way you arent going to have a lot of fun playing the game. Especially after you learn how to play it from the next lines in the description. you will start by choosing how you want the jigsaw puzzle be : hard medium or easy. After that, the jigsaw puzzle pieces are going to be spread around the game screen randomly. Use the mouse to drag them over the transparent images where they match with the image, until all the pieces are connected, and the image looks just like it did in the beginning. You will have a great time with the game, so start it right now, and we are sure you will not regret it one second!",
    "instructions": "Drag and drop ",
    "url": "https:\/\/html5.gamemonetize.com\/ikdfy9flqkn43zb07qg69qs2jwwu7z7o\/",
    "category": "Puzzle",
    "tags": "Cartoon",
    "thumb": "https:\/\/img.gamemonetize.com\/ikdfy9flqkn43zb07qg69qs2jwwu7z7o\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47219",
    "title": "Cube Sorting",
    "description": "In Sort Em All , your mission is to master the water sorting. Sort and merge the same color water in tubes with various shapes, using your strategic skills to solve each level. As you progress, the puzzles become more challenging, putting your brain to the ultimate test. Exercise your mental muscles and enjoy the satisfaction of finding the perfect sorting solution.",
    "instructions": "In Sort Em All your mission is to master the water sorting Sort and merge the same color water in tubes with various shapes using your strategic skills to solve each level As you progress the puzzles become more challenging putting your brain to th",
    "url": "https:\/\/html5.gamemonetize.com\/qw2drs3mi8kpt5od04jlgced20168yxg\/",
    "category": "Hypercasual",
    "tags": "3D, 3D Games, Adventure, Army, Ball",
    "thumb": "https:\/\/img.gamemonetize.com\/qw2drs3mi8kpt5od04jlgced20168yxg\/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "46060",
    "title": "Egg Farm Merge Puzzle",
    "description": "If you add an egg to an egg, what do you get?The more you merged, the more money you get.How far can your farm grow?",
    "instructions": "Drag and drop to match 3 of the same items in same row or column to get points",
    "url": "https:\/\/html5.gamemonetize.com\/s6o33yorr8cjpumfmj3k39mi41nfkh0h\/",
    "category": "Puzzle",
    "tags": "Chicken, Fun, Match-3",
    "thumb": "https:\/\/img.gamemonetize.com\/s6o33yorr8cjpumfmj3k39mi41nfkh0h\/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "46409",
    "title": "Head Volley",
    "description": "Have you ever played head volleyball before? Now is the time to play head volleyball. You must win the volleyball match by fighting with your friend or by fighting with artificial intelligence. You should join this volleyball fun too. Play with different costumes and win this match. Its up to you to win the match. You can play for two players or single player.",
    "instructions": " The players head jumps in that direction when we jump Use the w and Up Arrow buttons to jump Just tap to play on mobile ",
    "url": "https:\/\/html5.gamemonetize.com\/bmyr6k97k4bl6od1gczgn9bmg0owbya2\/",
    "category": "Arcade",
    "tags": "1 Player, 2 Player, 2 Player Games, 2D, Arcade, Arena, Casual",
    "thumb": "https:\/\/img.gamemonetize.com\/bmyr6k97k4bl6od1gczgn9bmg0owbya2\/512x384.jpg",
    "width": "800",
    "height": "600"
  }
]
